{"SIGCOMM": [["a", "SIGCOMM", "Annual Conference of the ACM Special Interest Group on Data Communication", "2020-02-07", "2020-05-15", "2020-08-10", "301"], ["SIGCOMM 2020: Annual Conference of the ACM Special Interest Group on Data Communication", "https://conferences.sigcomm.org/sigcomm/2020/", {"Submission Date": "2020-02-07", "Notification Date": "2020-05-15", "Conference Date": "2020-08-10", "Location": "New York City, USA", "Years": "25"}, "The ACM SIGCOMM 2020 conference seeks papers describing significant research contributions to the field of data communication networks and networked systems. SIGCOMM’18 takes a broad view of networking research. This includes new ideas relating to (but not limited to) mobile, wide-area, data-center, home, and enterprise networks using a variety of link technologies (wired, wireless, visual, and acoustic), as well as social networks and network architecture. It encompasses all aspects of networks and networked systems, including packet-processing hardware and software, virtualization, mobility, sensors, provisioning and resource management, performance, energy consumption, topology, robustness and security, measurement, diagnosis, verification, privacy, economics and evolution, interactions with applications, internet-of-things, novel applications of machine learning to networking, and usability of underlying networking technologies.\r\n\r\nWe want SIGCOMM’18 to be daring and emphasize novelty and creativity. The more novel the concept, the harder it can be to fully develop or evaluate all aspects, and the review process will take this into account. We encourage authors to discuss not only the benefits but also the limitations of their ideas.\r\n\r\nUnlike in previous years, SIGCOMM’18 will not have a separate experience track. However, we do encourage the submission of experience papers that provide detailed technical insight into real-world deployments of novel networking technologies and systems.\r\n\r\nIn addition to the main conference, SIGCOMM 2018 will have a series of co-located workshops, tutorials, poster and demo sessions, a travel grant program, and conference best paper and SIGCOMM awards.\r\n\r\nSubmissions\r\n\r\nSIGCOMM is a highly selective conference where papers report novel results typically substantiated by experimentation, deployment, simulation, or analysis. Submissions should be in two-column, 10-point format, and can be up to 12 pages in length with as many additional pages as necessary for references. Detailed submission instructions can be found on the conference web site.\r\n\r\nEthical Concerns\r\n\r\nAuthors must as part of the submission process attest that their work complies with all applicable ethical standards of their home institution(s), including, but not limited to privacy policies and policies on experiments involving humans. Note that submitting research for approval by one’s institution’s ethics review body is necessary, but not sufficient – in cases where the PC has concerns about the ethics of the work in a submission, the PC will have its own discussion of the ethics of that work. The PC takes a broad view of what constitutes an ethical concern, and authors agree to be available at any time during the review process to rapidly respond to queries from the PC chairs regarding ethical standards."]], "MobiCom": [["a", "MobiCom", "International Conference on Mobile Computing and Networking", "2018-03-06", "2018-05-24", "2018-10-29", "104"], ["MobiCom 2018: International Conference on Mobile Computing and Networking", "https://sigmobile.org/mobicom/2018/", {"Submission Date": "2018-03-06", "Notification Date": "2018-05-24", "Conference Date": "2018-10-29", "Location": "New Delhi, India", "Years": "24"}, "ACM MobiCom, the premier conference on mobile computing and wireless networking, seeks full papers describing significant research contributions in the systems design and implementation, practice, or theoretical aspects of providing users with an enriched and ubiquitous mobile or wireless experience. Papers addressing important challenges in access/communication, energy, computing, security and user experience as it applies to wireless networking and mobile computing form the core of the conference. We also invite submissions on a wide range of mobile computing and wireless networking research, including but not limited to:\r\n\r\n    Communications for Embedded and Energy-Harvesting Systems\r\n    Edge Computing\r\n    Long-Range/Low-Power Wide-Area Wireless Networking\r\n    Low-Latency Networking\r\n    Machine-to-Machine Communications\r\n    Millimeter wave and Terahertz Communications\r\n    Mobile Web\r\n    Next-Generation 5G mobile networks\r\n    Visible Light Communications\r\n    Mobile Data Science & Analysis\r\n    Mobile/Wireless Research & Cloud Computing\r\n    Mobile/Wireless Research & Software-Defined Networking\r\n    Sensing with Radio, Light, Sound, and Vibration\r\n    Wearable Computing\r\n\r\nSuccessful papers will address real research challenges through rigorous analysis, novel system design, and/or real-world measurement and deployment of mobile networks, systems and applications. The program committee will evaluate each paper using metrics that are appropriate for the topic area. All submissions must describe original research not published or currently under review for another conference or journal, and if accepted, papers will be published in the conference proceedings. MobiCom strongly encourages authors to describe how they will provide access to well-documented datasets, modeling and/or simulation tools, and codebases to support the reproducibility of their methods.\r\n\r\nIn addition to regular, full research papers, the conference also invites submission in the following categories:\r\n\r\nChallenge Papers\r\n\r\nThe conference invites submissions of short papers (limited to eight pages excluding references) that present revolutionary new ideas or that challenge existing assumptions prevalent among the wireless research community. These \"challenge papers\" should provide stimulating ideas or visions that may open up exciting avenues and/or influence the direction of future research. Descriptions of new products or evolution of existing work are not appropriate topics for papers in this category. While an exhaustive evaluation of the proposed ideas is not necessary, insight and in-depth understanding of the issues is expected. Challenge papers will be reviewed by the program committee and if selected, become part of the conference technical program and be published in the conference proceedings. Challenge papers should be submitted using the same submission procedure adopted for the full papers. The title of these papers must bear a \"Challenge:\" prefix\r\n\r\nExperience Papers\r\n\r\nThe conference invites submission of short papers (limited to eight pages excluding references) that present extensive experiences with implementation, deployment, and operations of mobile systems and wireless networks. Desirable papers are expected to contain real data as well as descriptions of the practical lessons learned. The experience papers will be evaluated by the program committee, primarily for (i) richness of their data or experiences, (ii) inferences drawn or lessons learned, (iii) discovery of new problems, and (iv) their impact/potential impact on current and future mobile systems and wireless networks, as well as on society. Note that a paper that builds a system and presents a limited experimental evaluation is NOT suitable as an experience paper. Selected experience papers will become a part of the conference technical program and will be publishedin the conference proceedings. Experience papers should be submitted according to the same submission procedure as full papers, and their title must bear an \"Experience:\" prefix.\r\n\r\nVerification Papers\r\n\r\nMobiCom welcomes contributions that seek to verify and/or characterize recent breakthrough results in mobile computing using rigorous experimental methodologies with the goal of extensively and thoroughly characterizing the operating parameters under which these results can be reproduced. Such submissions should be short papers (limited to eight pages excluding references) with \"Verification:\" as a prefix in the title. Selected verification papers will become a part of the conference technical program and will be published in the conference proceedings. Verification papers should be submitted according to the same submission procedure as full papers. "]], "INFOCOM": [["a", "INFOCOM", "International Conference on Computer Communications", "2019-07-24", "2019-12-14", "2020-04-27", "1"], ["INFOCOM 2020: International Conference on Computer Communications", "https://www.ieee-infocom.org", {"Submission Date": "2019-07-24", "Notification Date": "2019-12-14", "Conference Date": "2020-04-27", "Location": "Beijing, China", "Years": "39"}, "IEEE INFOCOM 2020 solicits research papers describing significant and innovative research contributions to the field of computer and data communications networks. We invite submissions on a wide range of research topics, spanning both theoretical and systems research. Topics include but not limited to:\r\n\r\n5G and beyond networks\r\nAge of Information\r\nBig data and machine learning for networks\r\nCellular networks\r\nCloud computing/mobile cloud computing\r\nChallenged Environments (underwater, underground)\r\nCross-layer optimization and control\r\nCrowdsourcing\r\nCubeSats\r\nCyber-physical systems\r\nDatacenter networking\r\nDynamic spectrum sharing\r\nEnergy efficiency in networks\r\nEdge and fog computing/networking\r\nFault tolerance, reliability and survivability\r\nInformation security and privacy\r\nInformation-centric networking\r\nInterference management and mitigation\r\nInternet architecture\r\nInternet of Things\r\nLocalization and location-based services\r\nMedium access control\r\nMIMO-based networking\r\nmmWave, THz, VLC, full duplex communication networks\r\nMobile sensing and applications\r\nMobility management and models\r\nMultimedia networking\r\nNetwork economics and pricing\r\nNetwork management\r\nNetwork measurement and analysis\r\nNetwork security and privacy\r\nNetwork virtualization\r\nOptical networks\r\nOverlay and peer-to-peer networks\r\nQuality-of-service and resource management\r\nRouter and switch design\r\nRouting and multicast\r\nScaling laws and fundamental limits\r\nSmart grid applications\r\nSocial computing and networks\r\nSoftware-defined networking\r\nVehicular networks\r\nWeb applications and content distribution\r\nWLAN, WPAN, RFID, and NFC\r\n \r\nIEEE INFOCOM incorporates a rigorous double-blind review process, empowered by a fully automated review assignment system that analyzes the submitted manuscripts and the representative publications of TPC members, and matches the submissions to TPC members’ expertise and interests. The automated review assignment system, termed Erie, is described in the following paper.\r\n\r\nB. Li and Y.T. Hou. “The new automated INFOCOM review assignment system,” IEEE Network, vol.30, no.5, pp.18-24, Sept./Oct. 2016. (http://ieeexplore.ieee.org/document/7579022/)\r\n\r\nAccepted and presented papers will be published in the IEEE INFOCOM 2020 Conference Proceedings and submitted to IEEE Xplore®. Full details of submission procedures and requirements for authors of accepted papers are available at http://infocom2020.ieee-infocom.org. \r\n\r\nTo encourage authors to submit their best work to the conference and to reduce unnecessary burden on the reviewers, we limit each individual to submit as author or co-author on no more than 8 papers. In the event that an individual submits more than 8 papers, the first 8 valid submissions (based on the order of paper registration) from that author will be accepted into the review process and the remainder will be rejected without review.\r\n\r\nPaper submission link on EDAS is: https://edas.info/newPaper.php?c=25772\r\n\r\nOriginality\r\n\r\nOnly original papers that have not been published or submitted for publication elsewhere will be considered. Technical Papers must be submitted via the EDAS Paper Processing System (https://edas.info/newPaper.php?c=25772). \r\n\r\nDouble blind submissions\r\n\r\nAll submitted papers will be judged based on their quality and relevance through double-blind reviewing, where the identities of the authors are withheld from the reviewers. As an author, you are required to preserve the anonymity of your submission, while at the same time allowing the reader to fully grasp the context of related past work, including your own. Common sense and careful writing will go a long way towards preserving anonymity. Papers that do not conform to our double-blind submission policies will be rejected without review.\r\n\r\nMinimally, please take the following steps when preparing your submission:\r\n\r\nRemove the names and affiliations of authors from the title page.\r\nRemove acknowledgments of identifying names and funding sources.\r\nRemove project titles or names that can be used to trace back to the authors via a web search engine.\r\nUse care in naming your files. Source file names (e.g., \"Alice-n-Bob.dvi\") are often embedded in the final output as readily accessible comments.\r\n\r\nUse care in referring to related work, particularly your own. Do not omit references to provide anonymity, as this leaves the reviewer incapable of grasping the context. Instead, reference your past work in the third person, just as you would any other piece of related work by another author. For example, instead of \"In prior work [3], we presented a routing protocol that ...,\" sentences in the spirit of \"In prior work, Smith and Clark [3] presented a routing protocol that ...\" should be used. With this method, the full citation to Smith and Clark can still be given, such as \"[3] J. Smith, A. Clark, \"Analysis of...\", and it is not acceptable to say \"[3] Reference deleted for double-blind review.\"\r\n\r\nThe submitted manuscript or its title/abstract should not be posted on a public website, such as arxiv.org, or transmitted via public mailing lists.\r\n\r\nThe submitted manuscript (PDF file) should be text-searchable. Any submission that does not meet this requirement may be returned without review.\r\n\r\nMany of the editing tools automatically add metadata to the generated PDF file containing information that may violate the double blind policy. Please remove any possible metadata that can link your manuscript to you. This includes removing names, affiliation, license numbers etc. from the Metadata as well as from the paper. Failing to meet this requirement may also lead to a rejection without review.\r\n\r\nRemove any embedded author/affiliation information in the PDF metadata. Go to Acrobat menu File/Properties… and remove any author information there.\r\n \r\nLength and formatting requirements\r\n\r\nSubmitted papers must be written in the English language, with a maximum length limit of 10 printed pages. Main text (including figures, tables, appendices, and any material other than references) must be no more than 9 pages. Papers that do not comply with the length limit will not be reviewed. Use the standard IEEE Transactions templates for Microsoft Word or LaTeX formats found at: https://www.ieee.org/conferences_events/conferences/publishing/templates.html. If the paper is typeset in LaTeX, please use an unmodified version of the LaTeX template IEEEtran.cls version 1.8, and use the preamble:\r\n\r\n\\documentclass[10pt, conference, letterpaper]{IEEEtran}\r\n\r\nDo not use additional LaTeX commands or packages to override and change the default typesetting choices in the template, including line spacing, font sizes, margins, space between the columns, and font types. This implies that the manuscript must use 10-point Times font, two-column formatting, as well as all default margins and line spacing requirements as dictated by the original version of IEEEtran.cls version 1.8."]], "NSDI": [["a", "NSDI", "USENIX Symposium on Networked Systems Design and Implementation", "2019-09-12", "2019-12-13", "2020-02-25", "303"], ["NSDI 2020: USENIX Symposium on Networked Systems Design and Implementation", "https://www.usenix.org/conference/nsdi20", {"Submission Date": "2019-09-12", "Notification Date": "2019-12-13", "Conference Date": "2020-02-25", "Location": "Santa Clara, California, USA", "Years": "17"}, "Overview\r\n\r\nNSDI focuses on the design principles, implementation, and practical evaluation of networked and distributed systems. Our goal is to bring together researchers from across the networking and systems community to foster a broad approach to addressing overlapping research challenges.\r\n\r\nNSDI provides a high-quality, single-track forum for presenting results and discussing ideas that further the knowledge and understanding of the networked systems community as a whole, continue a significant research dialog, or push the architectural boundaries of network services.\r\n\r\nTopics\r\n\r\nWe solicit papers describing original and previously unpublished research. Specific topics of interest include but are not limited to:\r\n\r\n    Highly available and reliable networked systems\r\n    Security and privacy of networked systems\r\n    Distributed storage, caching, and query processing systems\r\n    Energy-efficient computing in networked systems\r\n    Cloud/multi-tenant systems\r\n    Mobile and embedded/sensor applications and systems\r\n    Wireless networked systems\r\n    Network and workload measurement systems\r\n    Self-organizing, autonomous, and federated networked systems\r\n    Managing, debugging, and diagnosing problems in networked systems\r\n    Virtualization and resource management for networked systems\r\n    Systems aspects of networking hardware\r\n    Experience with deployed networked systems\r\n    Communication and computing over big data on networked systems\r\n    Practical aspects of economics and verification applied to networked systems\r\n    Any innovative solution for a significant problem involving networked systems\r\n\r\nLike NSDI 2019, we are offering two submission deadlines, and we are providing the possibility of getting one-shot-revision decisions in lieu of rejection. To see a detailed explanation of the expected benefits from these changes, see Additional Information about Multiple Deadlines Process.\r\n\r\nTwo Deadlines\r\n\r\nNSDI ’20 offers authors the choice of two submission deadlines. Any paper submitted to one of these deadlines and accepted during the subsequent reviewing period will be presented at the conference and will appear as part of the proceedings. In the meantime, authors are permitted to advertise their papers as accepted by NSDI, for example listing them on CVs.\r\n\r\nA paper submitted at the spring deadline for NSDI '20 and rejected may not be submitted again until the spring deadline for NSDI '21. A paper submitted at the fall deadline for NSDI '20 and rejected may not be submitted again until the fall deadline for NSDI '21.\r\n\r\nOne-Shot Revision\r\n\r\nEach paper may be accepted, rejected, or given the option of one-shot revision. Such a revision decision includes a summary of the paper's merits and a list of necessary changes that are required for the paper to be accepted at NSDI. Authors may then submit a version of their work addressing those needs during the subsequent deadline. At that point, the paper will be reviewed to judge whether it addresses the requirements requested; this review will be conducted, to the extent possible, by the same reviewers as earlier. To enable this, PC members who give one-shot-revision decisions late in a year are obligated to participate as external reviewers in the following year to review those papers' resubmissions, which would be considered for the following year's conference. Papers revised and re-submitted following a one-shot-revision decision can only receive a decision of accept or reject, not revise; this is what makes revisions \"one-shot.\"\r\n\r\nThe judgment about whether to accept a revised paper will be made as follows. Reviewers will primarily judge whether the authors have satisfied the requests accompanying the revision decision. They will also judge the resubmission on its independent merits, but should avoid rejecting it for non-fatal concerns that they could have raised during the first round of reviews. The reviewers should also ensure that the revised paper doesn't introduce new assertions without sufficient support. Unlike the shepherding process, the requested action points may include running additional experiments that obtain specific results, e.g., comparing performance against a certain alternative and beating it by at least 10%.\r\n\r\nDuring the revision period, the paper is still considered under review to NSDI and therefore cannot be submitted to other conferences unless the authors first withdraw it from consideration. To make this obligation clear, authors who receive a one-shot-revision notification must, within two weeks of the notification, explicitly send an email acknowledging their participation in the one-shot-revision process. That e-mail should indicate they understand that this means the USENIX Submission Policy precludes concurrent submission to other conferences.\r\n\r\nTo make a one-shot-revision decision, reviewers must be comfortable accepting the paper if the authors make all the changes requested in it. Most notably, if a paper makes an insufficient contribution, or is incremental, then it should be rejected, not given a one-shot-revision decision. After all, the point of one-shot revision is not to produce highly-polished uninteresting papers, but rather to allow publication of exciting work that's unfortunately submitted in a form that's flawed in a way that can't be fixed with mere shepherding.\r\n\r\nReviewers will also be instructed to not offer a one-shot-revision option if they can't determine that the paper is adequate modulo the proposed revisions. For instance, if the paper is written so sloppily that there may be a hidden deep flaw, then the paper should be rejected, not given a one-shot-revision request to fix the inadequate writing.\r\n\r\nAuthors given a one-shot-revision decision will be sent, within a few days of the decision, detailed instructions about how to re-submit. These instructions will include the list of necessary changes that are required for the paper to be accepted. They will also explain how the authors should accompany their re-submission with auxiliary material to demonstrate how they've satisfied that list of changes. This auxiliary material will consist of (1) an additional version of the re-submission in which revision changes since the first submission are clearly marked, and (2) a separate textual explanation of the high-level differences between the two versions.\r\n\r\nIf authors receive a one-shot-revision decision but don't want to submit a revised version, they may withdraw it. In this case, they may not submit the paper to NSDI again until 11 months after the deadline they originally it submitted to.\r\n\r\nIf authors receive a one-shot-revision decision for a paper submitted to the fall deadline of NSDI ‘20, this gives them the option to make the requested changes and re-submit it to the next NSDI deadline, which is the first deadline of NSDI '21. If the paper is accepted then, it will appear at NSDI '21, not NSDI '20.\r\n\r\nOperational Systems Track\r\n\r\nIn addition to papers that describe original research, NSDI '20 also solicits papers that describe the design, implementation, analysis, and experience with large-scale, operational systems and networks. We encourage submission of papers that disprove or strengthen existing assumptions, deepen the understanding of existing problems, and validate known techniques at scales or environments in which they were never used or tested before. Such operational papers need not present new ideas or results to be accepted; indeed, new ideas or results will not influence whether the papers are accepted. Note that the rules regarding submission and anonymization are different for operational systems track papers. Since the evaluation of operational systems track papers requires understanding the real-world use of the system, papers in this track will be reviewed in a more limited double-blind process. Authors' names should be withheld, as usual. However, in contrast to other papers, authors need not anonymize the content of their submission in any other way—they may keep company names, links, real system names, etc. as appropriate for the paper. Please note that you cannot switch tracks for your paper after submission since the submission rules differ.\r\n\r\nAuthors should indicate on the title page of the paper and in the submission form that they are submitting to this track.\r\n\r\nThe final program will make no distinction between papers accepted from this track and papers accepted from the regular track.\r\n\r\nWhat to Submit\r\n\r\nNSDI '20 is double-blind, meaning that authors should make a good faith effort to anonymize papers. Note that the operational track papers have different rules as described above. As an author, you should not identify yourself in the paper either explicitly or by implication (e.g., through the references or acknowledgments). However, only non-destructive anonymization is required. For example, system names may be left de-anonymized, if the system name is important for a reviewer to be able to evaluate the work. Please take the following steps when preparing your submission:\r\n\r\n    Remove authors' names and affiliations from the title page.\r\n    Remove acknowledgment of identifying names and funding sources.\r\n    Do not provide links to your own online content. If this online content is critical to the content of your paper, please see the submission form, which allows for some forms of content upload, or contact the PC chairs.\r\n    Use care in naming your files. Source file names, e.g., Joe.Smith.dvi, are often embedded in the final output as readily accessible comments.\r\n    Use care in referring to related work, particularly your own. Do not omit references to provide anonymity, as this leaves the reviewer unable to grasp the context. Instead, a good solution is to reference your past work in the third person, just as you would any other piece of related work. If you cite anonymous work, you will need to enter the deanonymized reference(s) on the online submission form.\r\n    If you need to reference another submission at NSDI '20 on a related topic, reference it as follows: \"A related paper describes the design and implementation of our compiler [Anonymous 2020].\" with the corresponding citation: \"[Anonymous 2020] Under submission. Details omitted for double-blind reviewing.\"\r\n    Work that extends an author's previous workshop paper is welcome, but the paper should (a) acknowledge their own previous workshop publications with an anonymous citation and (b) explain the differences between the NSDI submission and the prior workshop paper. The online submission form will also require authors to submit the deanonymized citation and a short explanation of the differences from the prior workshop paper.\r\n    Blinding is not intended to be a great burden. If blinding your paper seems too burdensome, please contact the program co-chairs and discuss your specific situation.\r\n\r\nSubmissions—as well as final papers—must be no longer than 12 pages, including footnotes, figures, and tables. Submissions may include as many additional pages as needed for references and for supplementary material in appendices. The paper should stand alone without the supplementary material, but authors may use this space for content that may be of interest to some readers but is peripheral to the main technical contributions of the paper. Note that members of the program committee are free to not read this material when reviewing the paper.\r\n\r\nSubmissions must be in two-column format, using 10-point type on 12-point (single-spaced) leading, in a text block 7\" wide x 9\" deep, with .33\" inter-column space, formatted for 8.5\" x 11\" paper.\r\n\r\nPapers not meeting these criteria will be rejected without review, and no deadline extensions will be granted for reformatting. Pages should be numbered, and figures and tables should be legible when printed without requiring magnification. Authors may use color in their figures, but the figures should be readable when printed in black and white. If you wish, you may use the template for LaTeX available on the conference paper templates page. All papers must be submitted via the submission form. Please do not email submissions. "]], "SenSys": [["b", "SenSys", "ACM Conference on Embedded Networked Sensor Systems", "2019-04-05", "2019-07-23", "2019-11-10", "61"], ["SenSys 2019: ACM Conference on Embedded Networked Sensor Systems", "http://sensys.acm.org/2019/", {"Submission Date": "2019-04-05", "Notification Date": "2019-07-23", "Conference Date": "2019-11-10", "Location": "New York, USA", "Years": "17"}, "The ACM Conference on Embedded Networked Sensor Systems (SenSys 2019) is the premier computer systems conference focused on the architecture, design, implementation, and performance of networked sensing systems, sensor-oriented data modeling and analytics, and sensor-enabled applications. ACM SenSys brings together academic, industry, and government professionals to a single-track, highly selective forum that takes a broad view on the areas of computing relevant to the future of networked embedded sensor systems. Topics of interests include, but are not limited to, the following:\r\n\r\n    New platforms and hardware designs for networked sensor systems\r\n    New communication paradigms for ubiquitous connectivity\r\n    Low-power wireless media access control, network, and transport protocol designs\r\n    Systems software, including operating systems, network stacks, and programming\r\n    System services such as time and location estimation\r\n    Low-power operation, energy harvesting, and energy management\r\n    Resource-efficient machine learning for embedded and mobile platforms\r\n    Mobile and pervasive systems with elements of networked sensing\r\n    Data management and analytics, including quality, integrity, and trustworthiness\r\n    Learning algorithms and models for perception, understanding, and adaptation\r\n    Heterogeneous collaborative sensing, including human-robot sensor systems\r\n    Security and privacy in networked sensor applications and systems\r\n    Fault-tolerance, dependability, and verification\r\n    Applications and deployment experiences\r\n\r\nWe invite technical papers describing original ideas, groundbreaking results, and real-world experiences involving innovative sensor systems. Successful submissions will explain why the topic is relevant to a vision of the future of sensing systems. Submissions will be judged on originality, significance, clarity, relevance, and correctness."]], "CoNEXT": [["b", "CoNEXT", "International Conference on emerging Networking EXperiments and Technologies", "2019-06-19", "2019-09-10", "2019-12-09", "10"], ["CoNEXT 2019: International Conference on emerging Networking EXperiments and Technologies", "https://conferences2.sigcomm.org/co-next/2019/", {"Submission Date": "2019-06-19", "Notification Date": "2019-09-10", "Conference Date": "2019-12-09", "Location": "Orlando, Florida, USA", "Years": "15"}, "The CoNEXT 2019 conference seeks papers presenting significant and novel research results on emerging computer networks and its applications. We especially encourage submissions that present novel experimentation, creative use of networking technologies, and new insights made possible using analysis. We invite submissions on a wide range of Networking topics. The list of topics includes (in alphabetical order):\r\n\r\n    Big Data platforms with applications to network management, security, measurements\r\n    Content distribution and caching, e.g., CDN, peer-to-peer, overlays\r\n    Design, analysis, and evaluation of network architectures\r\n    Experience and lessons learned by deploying large-scale networked systems\r\n    Internet measurement and modeling\r\n    Internet economics and policy\r\n    Innovative uses of network data beyond communication\r\n    Networking aspects of datacenters and cloud computing\r\n    Networking aspects of operating systems and virtualization architectures\r\n    Network aspects of Web, Video, and Virtual Reality applications\r\n    Network control and management, including SDN, NFV and network programmability\r\n    Network, transport, and application-layer protocols\r\n    Networking aspects of ubiquitous computing, including Internet-of-Things and Smart Cities\r\n    Networking aspects of online social networks\r\n    Reliability and availability of networks, protocols, and applications\r\n    Routing and traffic engineering\r\n    Security and privacy aspects of network applications and protocols\r\n    Topics at the intersection of energy-efficient computing and networking\r\n    Wireless networking in licensed and unlicensed spectrum\r\n\r\nWe are open to other contributions that stretch networking research outside of these topics, present new emerging computing trends, or potentially involve unfamiliar techniques. We ask authors to bear in mind that the main factor of interest for their work will be the implications of their results in networking. Potential authors who are unsure of the scope are encouraged to contact the PC chairs before submission.\r\n\r\nSubmission\r\n\r\nCoNEXT welcomes submission of both long and short papers (2-column, 10pt ACM format). All the submissions should be double-blind and will be peer-reviewed. Per the anonymity guidelines, you must remove any author names.\r\n\r\nLong papers are the more traditional form to present technical work and should be no more than 12 pages (up to two additional pages for appendices and unlimited pages for references). Short papers are the preferred vehicle for contributions whose novelty and impact show the same technical excellence, but whose description fits within 6 pages (one additional page for appendices and unlimited pages for references). Short papers will be reviewed with a more open mind towards the scope of evaluation or breadth of topics compared to long papers. Note that position papers, critiques of networking research, and ideas that are not yet fully complete or evaluated are a better fit for the HotNets workshop. We recommend that authors check both call for papers before submitting.\r\n\r\nWe welcome experience submissions that clearly articulate lessons learned, as well as submissions that refute prior published results. We value submissions more highly if they are accompanied by clearly defined artifacts not previously available, including traces, original data, source code, or tools developed as part of the submitted work.\r\n\r\nEthical concerns\r\n\r\nCoNEXT accords great importance to research ethics. Specifically, authors must attest that their work complies with all applicable ethical standards of their home institution(s), including, but not limited to privacy policies and policies on experiments involving humans. Submitting research for approval by one’s institution’s ethics review body is necessary, but not sufficient. The PC will have its own discussion of the ethics of that work whenever it has concerns about the ethics of a submission. Authors agree to be available at any time during the review process to rapidly respond to queries from the PC chairs regarding ethical standards. "]], "SECON": [["b", "SECON", "IEEE International Conference on Sensing, Communication and Networking", "2019-01-18", "2019-03-29", "2019-06-10", "311"], ["SECON 2019: IEEE International Conference on Sensing, Communication and Networking", "https://secon2019.ieee-secon.org/", {"Submission Date": "2019-01-18", "Notification Date": "2019-03-29", "Conference Date": "2019-06-10", "Location": "Boston, Massachusetts, USA", "Years": "16"}, "The 16th annual IEEE International Conference on Sensing, Communication and Networking (SECON) will provide a unique forum to exchange innovative research ideas, recent results, and share experiences among researchers and practitioners in wireless and mobile communication networks. The focus of this year’s IEEE SECON is twofold:\r\n\r\n    Systems research, experimentation, hands on evaluations:The conference aims to serve as the reference exhibit for state-of-the-art research supported by implementation and insights gained on all scales of experimental network architectures.\r\n    Cross-disciplinary wireless research: Looking beyond current networking paradigms, IEEE SECON welcomes pioneering cross-disciplinary work at the intersection of wireless and parallel disciplinary areas including (but not limited to) new devices, physics, biology, computing, to name a few, encompassing topics ranging from biological communication and computing networks to wireless communication networks in uncharted spectral bands.\r\n\r\nThe conference will have special plenary sessions for papers that fall under these broad categories, along with other regular sessions that encompass many other exciting developments in the wireless domain.\r\n\r\nPapers describing original, previously unpublished research work, experimental efforts, practical experiences, as well as visionary roadmaps, in all aspects of sensor networks, Internet of Things, mobile devices, and wireless communication are solicited. Particular topics of interest include, but are not limited to:\r\n\r\n    Wireless and mobile sensing systems in challenging media (e.g., underground, underwater, space)\r\n    Cellular communications and data networks, including 5G and beyond\r\n    Software defined and programmable networks\r\n    Cognitive radio and dynamic spectrum access\r\n    Internet of Things, Nano-Things and Bio-Nano-Things\r\n    New communication paradigms, such as Terahertz Communications, Optical Wireless Communications\r\n    Intra-body Networks and Molecular Communication Networks\r\n    Unmanned aerial systems; robotic wireless networks\r\n    Wearable computing and networking\r\n    Machine learning for wireless\r\n    Low-power and energy limited sensing and communications\r\n    Measurement of wireless and sensor systems, and novel experimental testbeds\r\n    Security, privacy, and trustworthiness of mobile, wireless and sensor systems\r\n    Survivability and fault tolerance in disaster scenarios\r\n    In-network processing/fog/edge computing in wireless networks\r\n    Application protocols and cross-layer design\r\n    Next generation applications enabled via wireless, such as virtual/augmented reality, autonomous driving, smart cities\r\n    Testing platforms for city-scale evaluation of new sensing systems\r\n\r\nPAPER SUBMISSION AND PUBLICATION\r\n\r\nPapers should neither have been published elsewhere nor be currently under review at another venue. All papers for IEEE SECON 2019 must be submitted via the conference submission page. Each submission must be no longer than 9 pages and in font size no smaller than 10 points. Submissions that violate the formatting guidelines will be rejected without review.\r\n\r\nAll submitted papers will be judged based on their quality and relevance through *double-blind* reviewing, where the identities of the authors are withheld from the reviewers. As an author, you are required to preserve the anonymity of your submission, while at the same time allowing the reader to fully grasp the context of related past work, including your own. Common sense and careful writing will go a long way towards preserving anonymity. Papers that do not conform to our double-blind submission policies will be rejected without review.\r\n\r\nTo be published in the IEEE SECON 2019 conference proceedings and to be eligible for publication in IEEE Xplore®, one author of each accepted paper is required to register for the conference at the full (member or non-member) rate. The paper must be presented by an author of that paper at the conference, unless the TPC co-chairs grant permission for a substitute presenter arranged in advance. The designated presenter should be qualified to both present the paper and answer questions. Non-refundable registration fees must be paid prior to uploading the final IEEE formatted, publication-ready version of the paper. Only IEEE Xplore compliant papers received by the camera-ready deadline can appear in the proceedings. For authors with multiple accepted papers, one full registration is valid for up to 3 papers. Accepted and presented papers will be published in the IEEE SECON 2019 conference proceedings and submitted to IEEE Xplore® as well as other Abstracting and Indexing (A&I) databases.\r\n\r\nThe organizers of IEEE SECON 2019 as well as our attendees expect accepted papers to be presented at the conference. IEEE reserves the right to exclude a paper from distribution after the conference (e.g., removal from IEEE Xplore) if the paper is not presented at the conference."]], "IPSN": [["b", "IPSN", "International Conference on Information Processing in Sensor Networks", "2019-10-16", "2020-01-10", "2020-04-21", "307"], ["IPSN 2020: International Conference on Information Processing in Sensor Networks", "http://ipsn.acm.org/2020", {"Submission Date": "2019-10-16", "Notification Date": "2020-01-10", "Conference Date": "2020-04-21", "Location": "Sydney, Australia", "Years": "19"}, "The International Conference on Information Processing in Sensor Networks (IPSN) is the leading annual forum on research at the intersection of networked embedded sensing, control, and systems design. Now in its 19th year, IPSN has been at the forefront of the development of today’s \"smart\" systems. IPSN brings together researchers from academia, industry, and government to present and discuss recent advances in both theoretical and experimental research on all aspects of networked systems of sensors and actuators. Its scope includes signal and image processing, information and coding theory, databases and information management, distributed algorithms, networks and protocols, wireless communications, collaborative objects, the Internet of Things, machine learning, mobile and social sensing, and embedded systems design. Of special interest are contributions at the confluence of multiple of these areas.\r\n\r\nIPSN 2020 continues its co-location with CPS-IoT WEEK, the premier venue for research and development of cyber-physical systems. IPSN is co-sponsored by both the ACM and IEEE, and it continues to emphasize research that bridges multiple research communities. IPSN is interested in all aspects of sensor networks, ranging from traditional topics such as networking to more recent developments such as embedded machine learning and computer vision.\r\n\r\nTopics of interest include, but are not limited to:\r\n\r\n    Sensor data storage, retrieval, processing\r\n    Coding, compression, and information theory\r\n    Theoretical foundations and fundamental bounds\r\n    Network and system architectures and protocols\r\n    IoT gateway platform architecture and services\r\n    Outdoor, wide-area, or crowdsourced sensing systems\r\n    Localization, synchronization, RFID, and RF sensing\r\n    Programming models, languages, and systems\r\n    Programming models for IoT ensembles\r\n    Modeling, simulation, and measurement tools\r\n    Operating systems and runtime environments\r\n    Applications in health, wellness & sustainability\r\n    Applications in smart cities and urban health\r\n    Experiences, challenges, comparisons of platforms\r\n    Discovery, coordination, and use of IoT services\r\n    Security and privacy\r\n    IoT reliability, adaptability, and dependability\r\n    Technical assessment of emerging IoT standards\r\n    Wearable systems and data processing algorithms\r\n    Sensor-enabled drone / autonomous vehicle platforms and algorithms\r\n    Machine learning and deep learning on sensor data\r\n    New hardware and system design to enable machine learning on sensor data\r\n    Novel embedded machine learning algorithms\r\n    Data related issues, such as methods, tools, and analysis\r\n    Fairness, equity, and transparency issues in IoT and CPS\r\n    Computer vision for resource-constrained and mobile platforms \r\n\r\nResearch artifacts, such as code, data sets, and tools, are highly encouraged to be submitted or made available simultaneously with paper submission. For the first time this year, IPSN 2020 will have a \"Best Research Artifact Award\", given to the authors who have contributed the research artifact that is judged to be most novel, easy to use, well documented, and useful to advance research.\r\n\r\nIPSN 2020 accepts double-blind paper submissions which have not been previously published. Posted technical reports (ArXiv or similar) do not count as prior publication and do not violate the double-blind requirement. Submitted manuscripts are up to 12 pages, inclusive of figures, tables, and references, following the ACM master article template. Papers are to be submitted at https://ipsn2020.hotcrp.com/ "]], "ICNP": [["b", "ICNP", "International Conference on Network Protocols", "2019-05-24", "2019-07-26", "2019-10-07", "43"], ["ICNP 2019: International Conference on Network Protocols", "https://icnp19.cs.ucr.edu", {"Submission Date": "2019-05-24", "Notification Date": "2019-07-26", "Conference Date": "2019-10-07", "Location": "Chicago, Illinois, USA", "Years": "27"}, "ICNP, the IEEE International Conference on Network Protocols, is the premier conference covering all aspects of network protocol research, including design, analysis, specification, verification, implementation, and performance. ICNP 2019 will be held in Chicago, Illinois, from Oct. 7-10, 2019.\r\n\r\nPapers with significant research contributions to the field of network protocols are solicited for submission. Papers cannot be previously published nor under review by another conference or journal. Papers containing plagiarized material will be subject to the IEEE plagiarism policy and will be rejected without review.\r\n\r\nTopics of interest include, but are not limited to:\r\n\r\n    All aspects of network protocol research including design, specification, verification, implementation, measurement, testing, and analysis.\r\n    Protocols for wireless networks, cellular networks, software-defined networks, data center networks, social networks, peer-to-peer networks, sensor networks, vehicular networks, and Internet of Things.\r\n    Domain-specific solutions, including protocols for network security, routing, user privacy, and network management.\r\n    Contributions to network architecture, e.g., specific algorithms and protocols for network virtualization or future Internet architectures.\r\n\r\nPapers must address specifically aspects of network protocol research. One of the accepted papers will be selected for a best paper award. Up to two of the best papers from ICNP will be fast tracked in the IEEE/ACM Transactions on Networking, with a streamlined journal review process.\r\n\r\nICNP 2019 will use a double-blind review process. Papers should adhere to the IEEE formatting requirements and should not exceed 10 pages excluding references (see conference website page for details). Authors are required to present accepted papers at the conference, and at least one author is required to register, at the full rate, in order for the paper to appear in the proceedings and the IEEE digital library. One of the authors MUST present the accepted paper at the conference. Exceptions from this policy for truly mitigating situations must be approved by the TPC Chairs before the beginning of the conference."]], "MobiHoc": [["b", "MobiHoc", "International Symposium on Mobile Ad Hoc Networking and Computing", "2019-11-30", "2020-03-29", "2020-06-30", "305"], ["MobiHoc 2020: International Symposium on Mobile Ad Hoc Networking and Computing", "https://www.sigmobile.org/mobihoc/2020/", {"Submission Date": "2019-11-30", "Notification Date": "2020-03-29", "Conference Date": "2020-06-30", "Location": "Shanghai, China", "Years": "21"}, "ACM Mobihoc is a premier conference with a highly selective single-track technical program dedicated to addressing the challenges emerging from networked systems that must operate in the face of dynamics ranging from changing user demands to connectivity and resource availability. Examples of such dynamic networks include wired/wireless communication, data-centers, sensors, energy, social, and transportation networks. Work that presents new performance evaluation methods, novel algorithms or provides fundamental insights for these systems is encouraged.\r\n\r\nWe are interested both in innovative works in an unexplored and/or emerging topic in the broad area of networks, and in novel findings and/or new insights that build on existing works. The specific areas of interest include, but are not limited to:\r\n\r\n    Internet of the Things (IoT), 5G, and next-generation wireless systems\r\n    Blockchain, social networks, societal networks, and emerging networked systems\r\n    Cloud computing, edge computing, and distributed computing over networks\r\n    Modeling, analysis, optimization, and control in computer and mobile networks\r\n    Performance, including energy efficiency, and reliability of networks and networked systems\r\n    All but physical layer issues of wireless communication and mobile networking\r\n    Communication and networking aspects of cyber-physical systems\r\n    Trust, security, and privacy in networks and networked systems\r\n    Incentive mechanism and interaction analysis of networked systems, network economics\r\n    Tasks, applications, sensing, and services over networks and networked systems\r\n    Software Defined Networking/Network Function Virtualization\r\n    Big-data analytics and machine learning for networks and networked systems\r\n    Information-centric networking, network caching, and coded caching\r\n    Coded computation and inference in networks\r\n\r\nAuthors can keep their names on their submitted paper, i.e., SUBMISSIONS ARE NOT REQUIRED TO BE DOUBLE BLIND. Authors can also prepare technical reports that are made available on their own websites and on purely archiving organizations such as arXiv.org. However, all submissions must comply with the dual submission policy. Each paper has a chance to submit a one-page rebuttal for the reviews. All submitted papers will be considered for a Best Paper Award. Papers are expected to be direct and specific about their results, contributions, and context."]], "NOSSDAV": [["b", "NOSSDAV", "International Workshop on Network and Operating Systems Support for Digital Audio and Video", "2018-03-15", "2018-04-20", "2018-06-15", "315"], ["NOSSDAV 2018: International Workshop on Network and Operating Systems Support for Digital Audio and Video", "http://nossdav.org/2018/", {"Submission Date": "2018-03-15 Extended", "Notification Date": "2018-04-20", "Conference Date": "2018-06-15", "Location": "Amsterdam, The Netherlands", "Years": "28"}, "Welcome to the webpage of NOSSDAV 2018, the 28th ACM SIGMM Workshop on Network and Operating Systems Support for Digital Audio and Video. The workshop will be co-located with ACM MMSys 2018, which will be held during June 12 - 15, 2018 in Amsterdam, The Netherlands. As usual, the Proceedings of NOSSADAV 2018 will be published by ACM and distributed at the workshop electronically, and will also be included in the ACM Digital Library.\r\n\r\nAs in previous years, the workshop will continue to focus on both established and emerging research topics, high-risk high-return ideas and proposals, and future research directions in multimedia networking and systems, in a single-track format the encourages active participation and discussions among academic and industry researchers and practitioners. Out-of-the-box ideas are particularly welcome.\r\n\r\nThe workshop seeks papers in all areas of multimedia networking and systems. Authors are especially encouraged to submit papers with real-world experimental results and real data sets. Topics of interest include, but are not limited to the following.\r\n\r\n    Applications for social media and networks\r\n    Augmented reality (AR) and virtual reality (VR)\r\n    Energy-aware and green computing\r\n    Media streaming, distribution and storage\r\n    Mobile, cloud, and peer-to-peer systems\r\n    Multi-core and many-core systems\r\n    Health care and quality of life\r\n    Multimedia communications\r\n    Multimedia data analytics and visualization\r\n    Networked games\r\n    Networked GPUs, graphics, and virtual environments\r\n    Real-time immersive systems\r\n    System security\r\n    Visual search\r\n    Web 2.0 systems and social networks\r\n    Wireless networks and embedded systems for multimedia applications\r\n    Systems for computer vision applications\r\n    Machine learning for multimedia systems\r\n\r\nDASH-IF Prizes: DASH-IF will offer prizes to best papers related to DASH-IF activities in ACM Multimedia Systems Conference and all co-located workshops, including NOSSDAV. "]], "IWQoS": [["b", "IWQoS", "International Symposium on Quality and Service", "2017-02-23", "2017-04-15", "2016-06-14", "302"], ["IWQoS 2016: International Symposium on Quality and Service", "http://www.ieee-iwqos.org/", {"Submission Date": "2017-02-23", "Notification Date": "2017-04-15", "Conference Date": "2016-06-14", "Location": " Vilanova i la Geltrú, Barcelona, Spain", "Years": "24"}, "\r\nCall for Symposium Papers\r\n\r\nQuality of Service (QoS) has long been the focus of communications and networking researchers worldwide. While traditional QoS research areas continue to attract much interest, recent exploration of Internet of things, data centers, virtualization, cloud and fog computing, cloud services, industrial communication systems, and “green” computing has motivated a new wave of research interest in service guarantees with QoS, and its related metrics of Quality of Experience (QoE), Quality of Protection (QoP), Software Quality, Knowledge Base Quality or, more broadly, Quality of Information Technology.\r\n\r\nFor more than two decades, IWQoS has established itself as a highly reputable forum to present novel ideas on all QoS-related subjects. IWQoS 2017 sets the goal to continuing to be a premier symposium and an international forum for presentation and discussion of cutting-edge research in the field. The scope of IWQoS 2017 covers both newest theoretical and experimental research papers.\r\n\r\nBesides regular papers, this year, IWQoS includes the Work-in-Progress track inviting papers presenting new talent, risky ideas, and new subjects to be discussed in a creative and inspiring atmosphere of the event. It is a lively forum to discuss work among each other and with senior researchers, with a special focus on work in progress, upcoming research challenges, and new directions in the field of QoS.\r\n\r\nTopics of interest include QoS issues in (but not limited to) the following areas:\r\n\r\n    Quality of services in Internet of things\r\n    Quality of cloud services and cloud computing\r\n    Quality of mobile cloud services and fog computing\r\n    Quality of protection, user experience, security and privacy\r\n    Quality of services in software-defined networking\r\n    Quality of services in information-centric networking\r\n    Quality of services in DTN, mobile and next generation cellular networking\r\n    Quality of services in information-centric networking\r\n    Quality of service in physical networks\r\n    System dependability, availability, resilience and robustness to faults and security attacks\r\n    Robustness against security vulnerabilities in critical infrastructures\r\n    Scheduling, resource management, queue management, admission control\r\n    Traffic engineering approaches and tools for provisioning and evaluation\r\n    Quality evaluation metrics and methodologies\r\n    QoS parsing, identification and control\r\n    Quality of software\r\n    Quality of experience in multimedia networks\r\n    Measurement, evaluation, adaptation and verification\r\n    Network operations, pricing and billing, network and service management\r\n    Architectures and protocols for IP, overlay and peer-to-peer networks, optical networks, wireless, ad hoc, mesh, and sensor networks\r\n    Energy awareness in communication systems\r\n    Design for future networks and computing systems with QoS in mind\r\n\r\nRegular Paper Submission Guidelines:\r\n\r\nIWQoS invites submission of manuscripts with original research results that have not been previously published or that are not currently under review by another conference or journal. Submissions will be rigorously judged based on originality, significance, interest, clarity, relevance, and correctness. IWQoS aims at rapid dissemination of research results. Regular paper submissions should be no longer than 10 single-spaced, double-column pages with font-size of 10.\r\nWork in Progress Paper Submission Guidelines:\r\n\r\nIWQoS invites submission of manuscripts not previously published or under submission elsewhere, offering new and unexplored, and, even untested ideas in related to QoS that present creative thinking, whilst at the same time opening new opportunities and research directions with high-risk-high-reward outlook. Doctorate students, and those with entrepreneurial ambitions are invited to present. Submissions will be judged based on originality, creativity, and potential. Work-in-progress paper submissions should be no longer than 5 single-spaced, double-column pages with font-size of 10.\r\n\r\nReviewing will be double-blind for both categories of papers. Submissions must not reveal the authors’ names and their affiliations and should make all efforts to avoid obvious self-references and disclosures. Submissions not meeting these guidelines will be rejected without consideration of their merits.\r\n\r\nAccepted and presented papers for both categories, will be published in the conference proceedings and submitted to IEEE Xplore as well as other Abstracting and Indexing (A&I) databases.\r\n\r\n\r\n"]], "IMC": [["b", "IMC", "Internet Measurement Conference", "2019-05-06", "2019-07-19", "2019-10-21", "28"], ["IMC 2019: Internet Measurement Conference", "https://conferences.sigcomm.org/imc/2019", {"Submission Date": "2019-05-06", "Notification Date": "2019-07-19", "Conference Date": "2019-10-21", "Location": "Amsterdam, The Netherlands", "Years": "19"}, "The Internet Measurement Conference (IMC) is a highly selective venue for the presentation of measurement-based research in data communications. The focus of IMC 2019 will be on research that improves the practice of network measurement, illuminates some facet of an operational network, or both. We encourage authors to discuss the implications of their results to future research and/or to operations. We also encourage authors to discuss representativeness and limitations of their work due to coverage of their measurements across space and time.\r\n\r\nIMC takes a broad view of contributions that are considered in scope for improving the practice of network measurement, including, but not limited to:\r\n\r\n    collection and analysis of data that yield new insights about network structure and network performance (e.g., traffic, topology, routing, energy utilization)\r\n    collection and analysis of data that yield new insights about application and end-user behavior (e.g., economics, privacy, security, application interaction with protocols)\r\n    modeling of network internals and application behavior (e.g., workloads, scaling behavior, assessment of performance bottlenecks)\r\n    methods and tools to monitor and visualize network-based phenomena\r\n    novel systems and algorithmic techniques that leverage measurement-based findings\r\n    advances in data collection, analysis, and storage (e.g., anonymization, querying, sharing)\r\n    reappraisal of previous empirical findings\r\n    descriptions of challenges and future directions the measurement community should pursue\r\n\r\nOperational networks of interest include:\r\n\r\n    the Internet backbone\r\n    edge networks (e.g., home networks, cellular networks, WLANs)\r\n    data center networks and cloud computing infrastructure\r\n    software-defined networks and network function virtualization\r\n    peer-to-peer, overlay, and content distribution networks\r\n    infrastructure for online social networks\r\n    experimental networks, prototype networks, and future Internetworks\r\n    large-scale distributed systems and online services\r\n\r\nAuthors unsure about topical fit are welcome to contact the program committee co-chairs at imc2019pcchairs@sigcomm.org.\r\n\r\nReview process and criteria\r\n\r\nIMC 2019 invites two forms of submissions:\r\n\r\n    Full papers (up to 13 pages for text and figures + unlimited pages for references) that describe original research, with succinctness appropriate to the topics and themes they discuss.\r\n    Short papers (up to 6 pages for text and figures + unlimited pages for references) that convey work that is less mature but shows exciting promise, OR offer results that do not merit a full submission. Short papers could articulate a high-level vision and describe challenging future directions that the authors believe the community should tackle; validate, verify, or update important results; or present new ideas that challenge existing assumptions.\r\n\r\nAny submission exceeding short paper page-length limit will be evaluated as a full paper.\r\n\r\nAuthors should only submit original work that has not been published before and is not under submission to any other venue. We will consider full paper submissions that extend previously published short, preliminary papers (including IMC short papers) following the model of the ACM SIGCOMM policy.\r\n\r\nIMC 2019 will bestow two awards on paper submissions, a Best Paper award and a Community Contribution award. The best paper award will recognize the outstanding paper at the conference, and all accepted papers are eligible for it. The community contribution award will recognize a paper with an outstanding contribution to the community in the form of a novel dataset, source code distribution, open platform, or other noteworthy service to the community. To be eligible for the community award, the authors must make publicly available their dataset (e.g., through DatCat for Internet measurement data or CRAWDAD for wireless data) or source code (e.g., via GitHub, Bitbucket), or have an open working platform, etc., by the camera-ready deadline. The authors indicate their eligibility on the submission form and are also encouraged to include a link to the contribution in the submitted paper itself.\r\n\r\nEthical Considerations\r\n\r\nPapers describing experiments with users or sensitive user data (e.g., network traffic, passwords, social network information) must follow basic precepts of ethical research and subscribe to community norms. These include: respect for privacy, secure storage of sensitive data, voluntary and informed consent if users are placed at risk, avoiding deceptive practices when not essential, beneficence (maximizing the benefits to an individual or to society while minimizing harm to the individual), and risk mitigation. When appropriate, authors are encouraged to include a subsection describing these issues. Authors may want to consult the Menlo Report for further information on ethical principles and the Allman/Paxson IMC 07 paper for guidance on ethical data sharing.\r\n\r\nNote that submitting research for approval by each author’s institutional ethics review body is necessary, but not sufficient – in cases where the PC has concerns about the ethics of the work in a submission, the PC will consider the ethical soundness and justification of any paper, just as it does its technical soundness. The PC takes a broad view of what constitutes an ethical concern, and authors agree to be available at any time during the review process to rapidly respond to queries from the PC chairs regarding ethical considerations. Authors unsure about ethical issues are welcome to contact the program committee co-chairs at imc2019pcchairs@sigcomm.org.\r\n\r\nIMC 2019 Shadow PC\r\n\r\nTo provide an educational experience by exposing students to a review process and to subsequently train the next generation of program committee (PC) members, the ACM IMC 2019 TPC would like to make submitted papers available to the shadow PC. Shadow PCs allow students and others interested in future PC service to read submitted papers and go through the reviewing process, ultimately arriving at a shadow conference program. This opportunity allows future PC members to learn first-hand about the peer-review process and gain experience as a reviewer.\r\n\r\nThe shadow PC process is run on a different system and the shadow PC reviewers will not have any access to the real reviews, the names of the real reviewers, or any other data such as relative rankings. Shadow PC reviewers will have to abide by the same rules and restrictions applicable to regular PC members. This includes, but is not limited to, rules against discussing the papers outside of the PC context, or using in any way results from reviewed papers before such papers have been published. Delegated reviews (i.e., external reviews) are not allowed for the shadow PC."]], "ANCS": [["c", "ANCS", "ACM/IEEE Symposium on Architectures for Networking and Communications Systems", "2019-07-22", "2019-08-09", "2019-09-24", "344"], ["ANCS 2019: ACM/IEEE Symposium on Architectures for Networking and Communications Systems", "http://www.ancsconf.org/", {"Submission Date": "2019-07-22 Extended", "Notification Date": "2019-08-09", "Conference Date": "2019-09-24", "Location": "Cambridge, UK", "Years": "15"}, "ACM/IEEE ANCS will be held 24th and 25th of September, 2019 in Cambridge, UK, and is the premier forum for presenting and discussing original research that explores the relationship between the algorithms and architectures of data communication networks and the hardware and software elements from which these networks are built. ANCS focuses on architectures for networking and communication in the broad sense, including novel architectures, architectural support for advanced communication, algorithms and protocols for advanced architectures, software and applications for next-generation networking architectures, co-design of computer and network systems, and methodology and benchmarking for evaluating advanced communication architectures.\r\n\r\nTopics of interest include, but are not limited to:\r\n\r\n● Wired and wireless communications systems architectures\r\n● Domain-specific languages for networked systems\r\n● Networked system architectures\r\n● SDN/NFV systems architectures\r\n● Converged system architectures (network, computation, memory and storage)\r\n● Architectures for in-network computing systems\r\n● Hardware/software co-design for networked systems architectures\r\n● Architectures supporting reconfigurable and programmable networked systems\r\n● Architectures for network security \r\n● Architectures for network measurement\r\n● Measurements of networked systems architectures\r\n● Measurements of communications architectures\r\n● Architectures for accelerators, offload engines and single-chip networking elements\r\n● Architectures and experiences for energy efficient networked systems design\r\n\r\nThe conference seeks an emphasis on the applicability and feasibility of approach, and will prioritize implementation and measurement-led submissions. Authors are invited to include artifacts and data sets as part of their submission, and those would be looked favourably by the committee. Submissions are double blind."]], "APNOMS": [["c", "APNOMS", "Asia-Pacific Network Operations and Management Symposium", "2019-05-27", "2019-07-10", "2019-09-18", "810"], ["APNOMS 2019: Asia-Pacific Network Operations and Management Symposium", "http://www.apnoms.org/2019/", {"Submission Date": "2019-05-27 Extended", "Notification Date": "2019-07-10", "Conference Date": "2019-09-18", "Location": "Matsue, Japan", "Years": "20"}, "The Asia-Pacific Network Operations and Management Symposium (APNOMS) is the premier conference on network operations and management in the Asia-Pacific region. APNOMS meets every year, typically during September or October, and boasts a rich history of successes. It includes a full three-day program of keynotes, tutorials, technical sessions, panel discussions, poster sessions, and exhibits focusing on managing networks that span the computing and telecommunications areas. APNOMS 2019 will encourage open discussions on technology alternatives that focus on the management and operation of current and future networks and services. APNOMS welcomes submissions based on implementation and experimentation, as well as simulation and analytical approaches. The topics of interest include, but are not limited to, the following items:\r\n\r\n1) Network Management\r\n\r\n    Management of Software Defined Network (SDN)\r\n    Management of the Future Internet(s)\r\n    Management of IP and Optical Networks\r\n    Management of Ad-hoc and Mesh Networks\r\n    Management of Wireless and Cellular Networks\r\n    Management of Sensor Networks\r\n    Management of Heterogeneous Networks\r\n    Management of Converged Networks\r\n    Management of Large Data Centers and Clouds\r\n    Management of Vehicular Networks\r\n    Peer-to-Peer and Overlay Networks\r\n    Cognitive Network Management\r\n\r\n2) Architectures, Methods & Technologies\r\n\r\n    New Network Architectures and Models\r\n    Next Generation BSS/OSS Platforms\r\n    New Network Protocols\r\n    Automatic Management\r\n    Software Defined Network (SDN)\r\n    Network functions Virtualization(NFV)\r\n    Cloud Computing\r\n    Edge/Fog Computing\r\n    Control Theoretic Management Approaches\r\n    Web/Java Based Management\r\n    Mobile Agent-based Management\r\n    Policy-based Management\r\n    Converged Networking Issues\r\n    SLA/QoS Management & Traffic Engineering\r\n    Network Monitoring and Measurements\r\n    Configuration and Fault Management\r\n    SNMP, Telemetry, NETCONF, Web Services, XML\r\n\r\n3) Service Management\r\n\r\n    Internet of Things (IoT) Management\r\n    Cyber Physical System (CPS) Management\r\n    Big Data Management\r\n    Ubiquitous Service Management\r\n    Management of Personalized Services\r\n    Services Science, Management & Engineering\r\n    Security Management Accounting and Billing\r\n    Applications and Service Provisioning\r\n    Seamless Service with Roaming and Handover\r\n    Signaling for Application Sessions and Networking\r\n    Management of Bandwidth on Demand\r\n    Regulatory Issues\r\n\r\n4) Business Management\r\n\r\n    Economic Aspects of NGNs and Future Internet(s)\r\n    Next Generation BSS Platforms\r\n    SLA/SLO/SLS Management\r\n    eTOM and ITIL\r\n    ISP/ASP/CSP Management\r\n    Business Process Engineering\r\n    Customer Care and Self Operations\r\n    e-Business Management\r\n\r\n5) Experiences\r\n\r\n    Trial Results, Migration and Case Studies\r\n    Interoperability Issues\r\n    R&D Networks\r\n    Advances in and Federation of Testbeds\r\n\r\nTechnical Session:\r\n\r\nAuthors are invited to submit complete unpublished papers in English, which are not under review in any other conferences or journals. Submission should be in form of a PDF file of a minimum of 3 pages and a maximum of 6 pages, prepared in accordance with IEEE author guidelines. All presented papers in the conference are expected to be included in the proceedings of the conference as well as IEEE Xplore Digital Library (pending) and IEICE archive system (pending), and will be indexed by EI and other Abstracting and Indexing (A&I) databases. The copyright of accepted papers will be transferred to IEICE. A submitted paper may be accepted as a short paper (presented in a poster session). NOTE: To be published in the proceedings, for each accepted paper, at least one author is required to register for the conference at the full (member or non-member) rate and the paper must be presented at the conference by one of the authors. Online presentation is not permitted without an unavoidable reason such as a natural disaster.\r\n\r\nInnovation Session:\r\n\r\nAPNOMS 2019 will include innovation sessions to present and discuss ongoing research, work-in-progress ideas, practical solutions, and experimental studies. Authors are requested to submit PDF documents in a special format (should have a visual in the upper half of a page and the explanatory text in the lower half, and must not exceed 20 annotated visuals including title and references). The sample file can be obtained at APNOMS website: http://www.apnoms.org/2019/manuscript.html. Innovation papers will be included in conference proceedings but will NOT be indexed by any scholarly research database. The copyright of accepted papers will belong to the author(s). The author(s) may transfer the copyright to a journal publisher if the same content or its extended version is submitted separately to a journal. In addition, it is possible to add a demonstration if you wish, please choose at the submission. "]], "FORTE": [["c", "FORTE", "International Conference on Formal Techniques for Distributed Systems", "2020-02-03", "2020-04-10", "2020-06-15", "251"], ["FORTE 2020: International Conference on Formal Techniques for Distributed Systems", "https://www.discotec.org/2020/forte", {"Submission Date": "2020-02-03", "Notification Date": "2020-04-10", "Conference Date": "2020-06-15", "Location": "Valletta, Malta", "Years": "40"}, "Scope\r\n\r\nFORTE 2020 is a forum for fundamental research on theory, models, tools, and applications for distributed systems.\r\n\r\nThe conference solicits original contributions that advance the science and technology for distributed systems, with special interest in:\r\n\r\n    Software quality, reliability, availability, and safety;\r\n    Security, privacy, and trust in distributed and/or communicating systems;\r\n    Service-oriented, ubiquitous, and cloud computing systems\r\n    Component- and model-based design\r\n    Object technology, modularity, software adaptation\r\n    Self-stabilization and self-healing/organizing\r\n    Verification, validation, formal analysis, and testing of the above.\r\n\r\nAligned with the above, FORTE covers models and formal specification, testing and verification methods for distributed computing. Application domains are multiple, and include all kinds of application-level distributed systems, telecommunication services, Internet, embedded and real-time systems, as well as networking and communication security and reliability.\r\n\r\nContributions that combine theory and practice and that exploit formal methods and theoretical foundations to present novel solutions to problems arising from the development of distributed systems are very much encouraged.\r\nMain Topics of Interest\r\n\r\nTopics of interest include but are not limited to:\r\n\r\n    Languages and semantic foundations\r\n\r\n    New modeling and language concepts for distribution and concurrency; semantics for different types of languages, including programming languages, modeling languages, and domain-specific languages; real-time and probability aspects\r\n\r\n    Formal methods and techniques\r\n\r\n    Design, specification, analysis, verification, validation, testing and runtime verification of various types of distributed systems, including communications and network protocols, service-oriented systems, adaptive distributed systems, cyber-physical systems and sensor networks\r\n\r\n    Foundations of security\r\n\r\n    New principles for qualitative and quantitative security analysis of distributed systems, including formal models based on probabilistic concepts\r\n\r\n    Applications of formal methods\r\n\r\n    Applying formal methods and techniques for studying quality, reliability, availability, and safety of distributed systems\r\n\r\n    Practical experience with formal methods\r\n\r\n    Industrial applications, case studies and software tools for applying formal methods and description techniques to the development and analysis of real distributed systems.\r\n\r\n    Emerging challenges and hot topics in distributed systems (broadly construed)\r\n\r\n    Formal specification, verification and analysis of emerging systems and applications, such as, for instance, software-defined networks, distributed ledgers, smart contracts, and blockchain technologies."]], "LCN": [["c", "LCN", "IEEE Conference on Local Computer Networks", "2019-05-17", "2019-07-05", "2019-10-14", "313"], ["LCN 2019: IEEE Conference on Local Computer Networks", "https://www.ieeelcn.org/index.html", {"Submission Date": "2019-05-17 Extended", "Notification Date": "2019-07-05", "Conference Date": "2019-10-14", "Location": "Osnabruck, Germany", "Years": "44"}, "The IEEE LCN conference is the premier conference on the leading edge of theoretical and practical aspects of computer networking. LCN is a highly interactive conference that enables an effective interchange of results and ideas among researchers, users, and product developers. For the past 43 years, major developments from high-speed networks to the global Internet to specialized sensor networks have been reported at this conference. Topics of interest include, but are not limited to:\r\n\r\n• Personal and wearable networks\r\n• Wireless ad hoc & sensor networks\r\n• Information-centric networking\r\n• Embedded networks\r\n• Opportunistic networking\r\n• Delay-tolerant networks\r\n• Cognitive radio networks\r\n• Vehicular networks\r\n• Smart Grid communications\r\n• Underwater sensor networks\r\n• Cyber-physical systems\r\n• Social networks\r\n• Mobile and ubiquitous networking\r\n• Green networking\r\n• Overlay and peer-to-peer networks\r\n• Local-area and metropolitan-area networks\r\n• Storage-area networks\r\n• Routing and transport protocols\r\n• Big Data Networking\r\n• Cloud computing and networking\r\n• Software Defined Networking and Network Function Virtualization\r\n• Internet of Things\r\n• Link technologies\r\n• Adaptive networking applications\r\n• Authentication, authorization, accounting\r\n• Security and privacy\r\n• Cross-layer optimization\r\n• Mobility and Location-dependent services\r\n• Multimedia and real-time communication\r\n• Machine-to-machine communications for smart environments\r\n• Smart Cities\r\n• Network traffic characterization and measurements\r\n• Network management, reliability and QoS\r\n• Performance evaluation of networks\r\n• Testbeds for network experiments\r\n• Network coding\r\n• Optical and high-speed access networks\r\n• E-Health networking\r\n\r\nAuthors are invited to submit papers describing original, previously unpublished work, not currently under review by another conference, workshop, or a journal. Full papers (up to 8 camera-ready pages, 10 pt font in IEEE format) should present novel perspectives within the general scope of the conference. Short papers are an opportunity to present preliminary or interim results and are limited to 4 camera-ready pages. Short papers will be presented in a poster session. Both full and short papers are published in the proceedings and IEEE Xplore. All papers must include title, complete contact information for all authors, abstract, and keywords on the cover page. IEEE reserves the right to remove papers from IEEE Xplore that are not presented at the conference.\r\n\r\nPaper submission: Papers must be registered on EDAS and submitted in PDF format. Detailed submission instructions are available at the conference website. Direct your questions to Program Chairs: Karl Andersson (karl.andersson@ltu.se) and Hwee-Pink Tan (hptan@smu.edu.sg). "]], "ICC": [["c", "ICC", "International Conference on Communications", "2019-10-28", "2020-01-27", "2020-06-07", "318"], ["ICC 2020: International Conference on Communications", "https://icc2020.ieee-icc.org/", {"Submission Date": "2019-10-28 Extended", "Notification Date": "2020-01-27", "Conference Date": "2020-06-07", "Location": "Dublin, Ireland", "Years": "19"}, "Themed, “Communications Enabling Shared Understanding,” this flagship conference of the IEEE Communications society will feature a comprehensive high-quality technical program including 13 symposia and a variety of tutorials and workshops. IEEE ICC 2020 will also include an attractive Industry program aimed at practitioners, with keynotes and panels from prominent research, industry and government leaders, business and industry panels, and vendor exhibits.\r\n\r\nTECHNICAL SYMPOSIA\r\n\r\nAd Hoc and Sensor Networks\r\nCognitive Radio and AI-Enabled Networks\r\nCommunication and Information Systems Security\r\nCommunication QoS, Reliability and Modeling\r\nCommunication Software, Services and Multimedia Applications\r\nCommunication Theory\r\nGreen Communication Systems and Networks\r\nMobile and Wireless Networks\r\nNext-Generation Networking and Internet\r\nOptical Networks and Systems\r\nSignal Processing for Communications\r\nWireless Communications\r\n\r\nSelected Areas in Communications\r\nAccess Networks/Systems and Power Line Communications\r\nBig Data\r\nCloud & Fog Computing, Networking, and Storage\r\nSmart Grid Communications\r\nE-Health\r\nInternet of Things\r\nMolecular, Biological, and Multi-Scale Communication\r\nSatellite and Space Communications\r\nSocial Networks\r\nTactile Internet"]], "ICCCN": [["c", "ICCCN", "International Conference on Computer Communication Networks", "2020-03-02", "2020-04-27", "2020-08-03", "131"], ["ICCCN 2020: International Conference on Computer Communication Networks", "http://icccn.org/icccn20/", {"Submission Date": "2020-03-02", "Notification Date": "2020-04-27", "Conference Date": "2020-08-03", "Location": "Honolulu, Hawaii, USA", "Years": "29"}, "ICCCN is one of the leading international conferences for presenting novel ideas and fundamental advances in the fields of computer communications and networks. ICCCN serves to foster communication among researchers and practitioners with a common interest in improving computer communications and networking through scientific and technological innovation.\r\n\r\nThe primary focus of the ICCCN 2020 conference is on new and original research results in the areas of design, implementation, and applications of computer communications and networks. Topics of interest include, but are not limited to, the following:\r\n\r\n- Cognitive, Ad Hoc, Mobile, and Mesh Networks (CAMM)\r\n- Communication Architecture, Algorithms, Modeling and Evaluation (CAAME)\r\n- Data Centers and Big Data Computing (DCBC)\r\n- Game, AI, and ML aided Network Design and Application (GAM)\r\n- Green Networking and Sustainable Computing (GREEN)\r\n- Grid, Cloud, Internet and Middleware Computing and Communication (GCIM)\r\n- Internet of Things (IoT)\r\n- Multimedia and Real-Time Networking (MRN)\r\n- Security, Privacy, Trust and Incentives (SPTI)\r\n- Sensor/Embedded Networks and Pervasive Computing (SNPC)\r\n- Software Defined Networks and and Network Virtualization Technologies (SDN/NFV)\r\n- Social Networks and Computing (SNC)\r\n- Hot Topics in Networking (HOT)"]], "MASS": [["c", "MASS", "International Conference on Mobile Ad-hoc and Sensor Systems", "2019-05-31", "2019-08-01", "2019-11-04", "74"], ["MASS 2019: International Conference on Mobile Ad-hoc and Sensor Systems", "http://sites.google.com/view/mass2019", {"Submission Date": "2019-05-31 Extended", "Notification Date": "2019-08-01", "Conference Date": "2019-11-04", "Location": "Monterey, California, USA", "Years": "16"}, "IEEE MASS 2019 is a premier annual forum for sharing original, novel ideas in mobile ad-hoc networks and smart systems, defined broadly. As wireless ad-hoc networks continue to evolve and specialize into a number of application scenarios and environments, and sensor-based systems and technologies increasingly permeate our everyday life and become the inner fabric of the Internet of Things and cyber-physical systems, the unfolding of smart environments such as smart cities, smart farming, smart healthcare, and smart manufacturing, to name a few, demand integrated solutions that can make intelligent use of both cloud and edge systems, while applying machine learning and artificial intelligence tools to handle their growing complexity and to leverage the vast amount of available data.\r\n\r\nSponsored by the IEEE Computer Society, the 16th edition of the IEEE International Conference on Mobile Ad-Hoc and Smart Systems (MASS) will be held in beautiful Monterey, CA, USA, on November 4-7, 2019, and it aims at bringing together researchers, developers, and practitioners to address recent advances in mobile ad-hoc and smart systems, covering algorithms, theory, protocols, systems & applications, experimental evaluations and testbeds, security/privacy, as well as AI/ML-based smart design.\r\n\r\nTopics of interest\r\n\r\nOriginal, unpublished contributions are solicited in all aspects of mobile ad hoc networks (MANETs) and smart systems, from mobile networking/computing to cyber-physical systems to Internet of Things, from theory to systems and applications. \r\n\r\nTopics of interest include, but are not limited to:\r\n\r\n    5G networks and technologies\r\n    AI/ML for smart  wireless networks\r\n    AI and machine learning aided protocol design and resource allocation\r\n    AI and machine learning based applications for ad hoc networks\r\n    Algorithms for MANETs and WSNs\r\n    Application Layer Protocols\r\n    Clustering, topology control, coverage, and connectivity\r\n    Cognitive networking\r\n    Cooperative and cognitive communication\r\n    Cooperative sensing, compressive sensing, sensing from communications\r\n    Cloud, crowd-sourced, participatory and (mobile) social sensing\r\n    Cyber-physical systems and applications\r\n    Data gathering, fusion, and dissemination\r\n    Energy-efficient architectures, algorithms, and protocols\r\n    Experiences in real-world applications and deployments\r\n    Flying Ad-Hoc Networks\r\n    Free-space optical networks\r\n    Heterogeneous networks\r\n    Internet of Things (IoT) devices, gateways, and infrastructure\r\n    Light-weight distributed machine learning \r\n    Localization and Location Based Services\r\n    Measurements, experimental systems and test-beds\r\n    Mobile computing and networking\r\n    mmWave and Terahertz networks\r\n    Mobility modeling and management\r\n    Multi-channel, multi-radio and MIMO technologies\r\n    Network components, operating systems, and middleware\r\n    Opportunistic networking, delay tolerant networking\r\n    QoS and Resource management\r\n    Robotic networks\r\n    Routing protocols\r\n    Scalability, stability, and robustness of networks and sensor systems\r\n    Security and privacy at all layers, including the physical layer\r\n    Sensor enabled drone, UAV, UUV systems\r\n    Smart grid, healthcare, transportation applications\r\n    Vehicular networks and protocols\r\n    Visible light communications\r\n    Wearable and human-centric devices and networks"]], "P2P": [["c", "P2P", "International Conference on Peer-to-Peer Computing", "2015-05-11", "2015-08-03", "2015-09-21", "59"], ["P2P 2015: International Conference on Peer-to-Peer Computing", "http://wan.poly.edu/p2p2015/", {"Submission Date": "2015-05-11", "Notification Date": "2015-08-03", "Conference Date": "2015-09-21", "Location": "Cambridge, Massachusetts, USA", "Years": "15"}, "GENERAL INFORMATION\r\n\r\nOver a decade of evolution in peer-to-peer computing has brought many advances to distributed systems. Besides establishing solid theoretical principles, this research has led to practical systems that benefit millions of Internet users. It has also helped push the frontier of computing applications, data, and services away from central nodes to the logical extremes of networks, where they can leverage edge resources such as user machines, access points, home gateways, and personal and enterprise clouds.\r\n\r\nThe IEEE P2P conference seeks high-quality, original contributions that advance the state-of-the-art in theoretical and systems aspects of P2P and edge computing. Relevant topics include, but are not limited to:\r\n\r\n- P2P systems and applications\r\n- P2P applications and systems running in the Internet, clouds and mobile systems\r\n- Leveraging users' cloud resources, including personal and enterprise clouds\r\n- Crowdsourcing\r\n- Security, privacy, anonymity, and anti-censorship\r\n- Economics of P2P and edge computing\r\n- Overlay architectures and technologies\r\n- Self-organization and self-management\r\n- Citizen participation systems\r\n- Decentralized alternatives to logically centralized services such as web search and social networks\r\n- Decentralized policy enforcement, participation incentives, trust, and reputation\r\n- User experience and engagement as the drivers for systems and network design\r\n- Blockchain architectures and decentralized cryptocurrencies\r\n- Experience with deployed systems and applications\r\n- Measurements and modeling of systems and networks\r\n- Performance, availability, robustness, and scalability\r\n\r\nPaper submissions are limited to 10 pages; see the conference website for more details about paper submission. "]], "IPCCC": [["c", "IPCCC", "International Performance Computing and Communications Conference", "2019-07-08", "2019-08-16", "2019-10-29", "912"], ["IPCCC 2019: International Performance Computing and Communications Conference", "http://www.ipccc.org/", {"Submission Date": "2019-07-08 Extended", "Notification Date": "2019-08-16", "Conference Date": "2019-10-29", "Location": "London, UK", "Years": "38"}, "The International Performance, Computing, and Communications Conference is a premier IEEE conference presenting research in the performance of computer and communication systems. For over three-and-a-half decades, IPCCC has been a research forum for academic, industrial, and government researchers. We encourage submission of high-quality papers reporting original work in both theoretical and experimental research areas.\r\n\r\nHot Topics For IPCCC 2019\r\n\r\nTopics of interest include, but are not limited to:\r\n\r\n    Big Data Processing and Analytics\r\n    Edge Computing\r\n    Crowdsourcing Systems\r\n    Cyber Physical Systems\r\n    Data Centers and Cloud Computing\r\n    Embedded Systems\r\n    Internet of Things\r\n    Network Protocols\r\n    Multimedia Networking\r\n    Network Data Mining\r\n    Security and Privacy\r\n    Ubiquitous Computing\r\n    Software Defined Networking\r\n    Cache, Memory, and Disk Storage Systems\r\n    Fundamental Theory and Algorithms for Computing and Communication Systems\r\n    Named Data Networking\r\n    Mobile Augmented/Virtual/Mixed Reality\r\n    Blockchain and Distributed Ledger\r\n\r\nInternet Services and Network Management\r\nMany-core and Heterogeneous Computing\r\nMobile Ad Hoc, Sensor and Mesh Networks\r\nNetwork Information Assurance and Security\r\nOnline Social Network Analysis\r\nParallel and Distributed Systems\r\nPerformance Evaluation and Modeling for Computing and Communication Systems\r\nSmart Grid and Intelligent Mission Critical Operations\r\nSmart Health Systems, Wearable, and Implantable Systems\r\nSmartphone and Mobile Applications\r\nWireless Communication and Networks\r\nWorkload Characterization & its Impacts on Architecture Design\r\nNetworks on Chip\r\nAI-assisted Networking and Systems"]], "WoWMoM": [["c", "WoWMoM", "International Symposium on a World of Wireless, Mobile and Multimedia Networks", "2020-01-08", "2020-03-18", "2020-06-15", "652"], ["WoWMoM 2020: International Symposium on a World of Wireless, Mobile and Multimedia Networks", "http://www.cs.ucc.ie/wowmom2020", {"Submission Date": "2020-01-08 Extended", "Notification Date": "2020-03-18", "Conference Date": "2020-06-15", "Location": "Cork, Ireland", "Years": "21"}, "SCOPE AND OVERVIEW      \r\n\r\nIEEE WoWMoM 2020 is soliciting original and previously unpublished papers addressing research challenges and advances in the areas of wireless, mobile, and multimedia networking as well as ubiquitous and pervasive systems. WoWMoM’s programme focuses on wireless networking technologies and their key role in future Internet scenarios. The symposium addresses the increasing wealth of opportunities for distributing multimedia contents over wireless networks, enabling dissemination of professional contents to mobile users as well as sharing user-generated contents among them. Users will be able to retrieve, publish, and manage information, communicate with other users or devices, access and author services, and create and exploit context-awareness. Papers that present original work, validated by experimentation, simulation, or analysis, are solicited. Practical experiences and experimental efforts from both industry and academia, duly documenting the lessons learned from testbeds, field-trials, or real deployments, are also welcome.\r\nPapers that present original work, validated by experimentation, simulation, or analysis, are solicited. Practical experiences and experimental efforts from both industry and academia, duly documenting the lessons learned from testbeds, field-trials, or real deployments, are also welcome.\r\n\r\nSpecific areas of interest:\r\n\r\n• Ad-hoc, sensor, mesh and vehicular wireless networks\r\n• Content-centric architectures for wireless, mobile and multimedia networks\r\n• Context-awareness in wireless, mobile and multimedia networks\r\n• Cognitive communications and networking\r\n• Dependability and survivability issues for wireless, mobile and multimedia networks\r\n• Energy-efficiency for wireless, mobile and multimedia networks\r\n• Internet/Web of Things\r\n• Localisation, tracking, and mobility management and services\r\n• Middleware services for wireless, mobile and multimedia networks\r\n• Mobile applications and services over 5G networks\r\n• Mobile big data networking and services\r\n• Mobile cloud computing\r\n• Mobile edge computing\r\n• Mobile health networking\r\n• Mobile network traffic characterization and measurements\r\n• Mobile social networks\r\n• Modelling, analysis, and performance evaluation of wireless, mobile and multimedia networks\r\n• Network virtualisation and software-defined wireless networks\r\n• Opportunistic and delay-tolerant networks\r\n• Participatory, mobile and urban sensing\r\n• Resource management and QoS/QoE provisioning\r\n• RFID, NFC, and Machine-to-machine (M2M) communications\r\n• Satellite and space networking\r\n• Seamless inter-networking and self-organisation\r\n• Security, trust and privacy issues for wireless, mobile and multimedia networks\r\n• System prototypes, measurements, real-world deployment, and experiences\r\n• Underwater wireless, mobile and multimedia networks\r\n• Virtual mobile infrastructure\r\n• Wireless BAN, PAN, LAN, MAN and WAN\r\n• Wireless multimedia systems, services and applications\r\n• Wearable Computing"]], "ISCC": [["c", "ISCC", "IEEE symposium on Computers and Communications", "2019-03-01", "2019-04-05", "2019-06-29", "308"], ["ISCC 2019: IEEE symposium on Computers and Communications", "http://paradise.site.uottawa.ca/iscc2019/", {"Submission Date": "2019-03-01 Extended", "Notification Date": "2019-04-05", "Conference Date": "2019-06-29", "Location": "Barcelona, Spain", "Years": "24"}, "The first IEEE Symposium on Computers and Communications (ISCC) was held in 1995 in response to the growing interaction between the fields of computers and communications. The 2019 thematic is Computers and Communications on the edge and fog, following new challenges related to smart computing and networking, with big data computing, and communications performance.\r\n\r\nISCC takes place annually, usually in the Mediterranean region, in locations such as Egypt, Greece, France, Tunisia, Portugal, Spain, Morocco, Italy, and Brazil. In 2019, the Symposium is going to happen in Barcelona City, Spain.\r\n\r\nISCC sessions will include presentations on new research results and tutorials. Papers describing original work are invited in any of the computer and communications areas that the Call for Papers considers. Accepted papers will be included in the ISCC 2019 Conference Proceedings, which will be subject to independent IEEE peer-review procedures for quality, and may be eligible for inclusion in the IEEE Xplore® Digital Library. Merit, relevance, and originality will guide paper acceptance. Best Paper Award and Best Student Paper Awards will be presented.\r\n\r\nCall for Papers\r\n\r\nISCC 2019, in its 24th edition, will provide an insight into the unique world stemming from the interaction between the fields of computers and communications. ISCC 2019 will provide an international technical forum for experts from industry and academia to exchange ideas and present results of on-going research in most state-of-the-art areas of computers and communications. This year, special focus will be computers and communications on the fog. You are invited to submit a full paper, a proposal for a Panel/Invited Session or a Tutorial, related to the following topics of interest:\r\n\r\n    5th Generation Networks\r\n    Access Networks\r\n    Advances in Internet Protocols\r\n    Wireless, Cellular, and Mobile Communications\r\n    Mobile Cloud and Mobile Cloud Networking\r\n    Bio-inspired Computing in Communications\r\n    Bioinformatics and Medical informatics\r\n    Cloud Computing (IaaS, PaaS, and SaaS)\r\n    Cognitive Radio Networking\r\n    Communications Services and Management\r\n    Connected Vehicles\r\n    Cyber Physical Systems and Internet of Things\r\n    Digital Media Technologies\r\n    Digital Satellite Communications Service\r\n    Distributed and Mobile Middleware\r\n    Distributed Systems Architecture and Management\r\n    E-Commerce and E-Services\r\n    Economic and Regulatory Issues\r\n    Fault-Tolerance and Error Recovery\r\n    Fog Computing\r\n    Green Networking and Smart Grid\r\n    Grid and Cluster Computing\r\n    Human Language Technologies\r\n    Image Processing and Visualization\r\n    Real Time Communication Services\r\n    Internet of Things and Smart Cities\r\n    Internet Services and Applications\r\n    Modeling and Simulation\r\n    Management of Telecommunications and Networks\r\n    Big Data, Data Mining and Database Applications\r\n    Network Design, Optimization and Management\r\n    Network Reliability, Quality of Service and Quality of Experience\r\n    Next Generation Networks Infrastructures and Management\r\n    Artificial Intelligent Systems applications in Computers and Communications\r\n    Overlay and Programmable Networks\r\n    Peer-to-Peer Computing\r\n    Internet of the Future\r\n    Routing and Multicast\r\n    Security, Cryptography, and Privacy\r\n    Sensor Networks and Mobile Sensing\r\n    Wireless Body Area Network and Wireless Health?\r\n    Social Networks, Crowdsourcing, and Crowdsensing\r\n    Web Services and Service Oriented Architectures\r\n    Software Defined Networks and Network Function Virtualization\r\n    Software Defined Smart Objects\r\n    Software Engineering\r\n    Standards Evolution\r\n    Software Defined Datacenters\r\n    Optical Networking\r\n    Molecular, Biological, and Multi-scale Communications\r\n    Signal Processing for Communications\r\n    Services and Support for Smart Cities\r\n\r\nSubmission Guidelines:\r\n\r\nReview manuscripts should describe original work and should be no more than 7 pages in the IEEE double column proceedings format including tables, figures and references. Download manuscript templates for IEEE conference proceedings <>. Note that accepted papers up to 6 pages will be published with no additional charge. Exceeding pages will be charged an additional fee.  Papers exceeding 7 pages will not be accepted at EDAS. Extended versions of selected best papers will be recommended for publication in a special issue of a prestigious international journal. At least one author of each accepted paper is required to register to the conference and present the paper. Only registered and presented papers will be published in the conference proceedings.\r\n\r\nIn IEEE ISCC 2019, all submissions must be done through EDAS in the link Here. Please contact the Technical Program Co-Chairs of the IEEE ISCC 2019 for any questions regarding the submission of manuscripts. \r\n\r\nAccepted papers will be included in the ISCC 2019 Proceedings and will be submitted for inclusion to IEEE Xplore. The IEEE ISCC Proceedings have been indexed in the past by ISI, dblp and Scopus. This makes the IEEE ISCC conference one of the publication venues with very high visibility and impact in both Computer and Communications areas."]], "WCNC": [["c", "WCNC", "IEEE Wireless Communications & Networking Conference", "2019-11-05", "2019-12-31", "2020-04-06", "316"], ["WCNC 2020: IEEE Wireless Communications & Networking Conference", "https://wcnc2020.ieee-wcnc.org/", {"Submission Date": "2019-11-05 Extended", "Notification Date": "2019-12-31", "Conference Date": "2020-04-06", "Location": "Seoul, Korea", "Years": "18"}, "IEEE WCNC is one of the main venues for researchers, industry professionals, and academics interested in the most advanced and recent contributions to wireless communications, especially regarding the design and development of wireless systems and networks. Sponsored by the IEEE Communications Society, IEEE WCNC has a long history of connecting industry, academia, and regulatory bodies. In 2020, other than mesmerizing its visitors by its beauty, Seoul as the capital of Korea will become the premium venue of the wireless by hosting WCNC‘20. The conference will include technical sessions, tutorials, workshops, and technology/business panels. You are invited to submit papers in all areas of wireless communications and networks. Potential topics include, but are not limited to:\r\nTrack 1: PHY and Fundamentals\r\n\r\n    Channel modeling, characterization and estimation\r\n    Modulation, coding, diversity, equalization, synchronization\r\n    Multi-carrier modulation, waveform design\r\n    Interference modeling, management, cancellation and alignment\r\n    PHY strategies for low-rate, sporadic and asynchronous communications\r\n    MIMO, massive MIMO and cloud-RAN\r\n    Cooperative, device-to-device and multi-hop communication\r\n    Cognitive radio, spectrum sensing\r\n    Content caching and storage in wireless networks\r\n    PHY layer design for cellular, wireless LAN, ad hoc and sensor networks\r\n    Energy efficient and energy harvesting PHY layer design\r\n    Joint information and energy transmission\r\n    PHY layer security and privacy\r\n    Ultra-wideband, mmWave and sub-THz communication\r\n    Information-theoretic aspects of wireless communications\r\n    Signal processing for wireless communications\r\n    Molecular and nano communications\r\n    AI, machine learning and data analytics for wireless communications\r\n    Beyond 5G and 6G\r\n    Full duplexing\r\n\r\nTrack 2: MAC and Cross-Layer Design\r\n\r\n    Wireless MAC protocols for 5G: design, analysis, and optimization\r\n    Cognitive and cooperative MAC\r\n    MAC for mesh, ad hoc, relay and sensor networks\r\n    Scheduling and radio resource management\r\n    Cross-layer MAC design\r\n    Software defined radio, RFID MAC\r\n    QoS support and energy efficient MAC\r\n    MAC protocol for energy harvesting wireless networks\r\n    MAC design for multitier cellular/small cell networks\r\n    Multiple access in machine-to-machine communication\r\n    MAC for cloud-RAN\r\n    MAC protocols for molecular and nano networks\r\n    MAC protocols for mmWave networks\r\n    Full-duplex MAC design\r\n    Cross-layer design for massive MIMO and multiuser MIMO networks\r\n    AI, machine learning and data analytics for MAC and cross-layer design\r\n\r\nTrack 3: Wireless Networks\r\n\r\n    Software-defined mobile / wireless networks\r\n    Wireless Network Functions Virtualization\r\n    Virtual network management and orchestration\r\n    Mobile cloud\r\n    Fog computing and networking\r\n    Mobile Edge Computing\r\n    Mesh, relay, sensor and ad hoc networks\r\n    Routing and congestion in wireless networks\r\n    Cognitive radio and networking\r\n    Resource management and optimization\r\n    Mobile big data and network data analytics\r\n    Wireless network security and privacy\r\n    Mobile social networks\r\n    Wireless network measurements and characterization\r\n    AI, machine learning and data analytics for wireless networks\r\n    Wireless networking for autonomous vehicles\r\n    Wireless networking for smart X (energy, factory, city, etc.)\r\n    IoT wireless networking\r\n\r\nTrack 4: Emerging Technologies, Architectures and Services\r\n\r\n    Mobile / Wireless network support for vertical industries\r\n    Adaptive content distribution in on-demand services\r\n    Context and location-aware wireless services and applications\r\n    User-centric networks and adaptive services\r\n    Wireless body area networks and e-health services\r\n    Intelligent transportation systems\r\n    Dynamic sensor networks for urban applications\r\n    Wireless emergency and security systems\r\n    Ultra-reliable communication\r\n    Enabling regulations, standards, spectrum management\r\n    Hybrid licensed/unlicensed spectrum access schemes\r\n    Technologies, architectures and enabling business models for rural communications\r\n    Satellite-based mobile access and backhaul\r\n    Hybrid satellite-terrestrial networks\r\n    Testbed and prototype implementation of wireless services"]], "Networking": [["c", "Networking", "International Conferences on Networking", "2019-12-31", "2020-04-01", "2020-06-23", "304"], ["Networking 2020: International Conferences on Networking", "https://networking.ifip.org/2020/", {"Submission Date": "2019-12-31", "Notification Date": "2020-04-01", "Conference Date": "2020-06-23", "Location": "Paris, France", "Years": "19"}, "The International Federation for Information Processing (IFIP) Networking 2020 Conference (NETWORKING 2020) will be held in Paris, France. This is the 19th event of the series, sponsored by the IFIP Technical Committee on Communication Systems (TC6). Accepted papers will be published in the IFIP Digital Library and submitted to the IEEE Xplore Digital Library. High quality papers will be recommended for fast track publications in selected journals.\r\n\r\nThe main objective of Networking 2020 is to bring together academic and industrial experts of the networking community to discuss the most recent advances in networking, to highlight key issues, identify trends, and develop a vision of the future Internet from a design, deployment and operation standpoints. Networking 2020 technical sessions will be structured around the following yet non limitative areas:\r\n\r\n    Network Architectures, Applications and Services\r\n        Network automation techniques, including (but not limited to) policy-based network management, software-defined networking (SDN), dynamic policy enforcement and resource allocation schemes, dynamic service parameter negotiation frameworks, and feedback mechanisms\r\n        Artificial intelligence applied to networking: dynamic resource negotiation and provisioning, dynamic service structuring (orchestration) and delivery\r\n        Service function chaining\r\n        Data center networking; fog, edge and cloud computing design and operation\r\n        (Multi-tenant) networking slicing, from slice parameter negotiation to provisioning and operation\r\n        Drone networking and related unmanned technology-based services and applications\r\n        Protective and collaborative networking: dynamic threat anticipation and mitigation, dynamic attack mitigation practices, inter-DDoS Service Provider (DPS) collaboration, collaborative autonomous and SDN networking\r\n        Transactional networking: attack-proof and resiliency techniques applied to financial networking, inter-domain banking services\r\n        Internet of Things (IoT): cross-platform IoT service design, delivery and operation\r\n        Privacy-based networking: multi-metric routing schemes, resiliency designs\r\n        Quantum communications: automated key allocation schemes, quantum key exchange in various networking environments (satellite, optical)\r\n        Tbit/s optical and wireless networking\r\n        Overlay and P2P networks\r\n        Evolution of IP network architectures and protocols\r\n        Green networking\r\n        Resilient networks\r\n        Traffic engineering\r\n        Quality of Service\r\n        Emerging value-added services and applications\r\n\r\n    Network Modeling, Analysis and Operation\r\n        Topology characterization\r\n        Performance measurements\r\n        Traffic monitoring and analysis\r\n        Use behavior modeling\r\n        Quality of Experience\r\n        Data-driven network design\r\n        User profiling and tracking\r\n        Complex and dynamic networks\r\n        Analysis of participatory networks\r\n        Social networks\r\n        Socio-economic aspects of networks, pricing and billing\r\n        Network Neutrality\r\n\r\n    Network Security and Privacy\r\n        Network security protocols\r\n        Trust and privacy\r\n        Anomaly and malware detection\r\n        Denial-of-service detection and mitigation\r\n        Network forensics\r\n        Authentication\r\n        Applications of privacy-preserving computation in networks\r\n        Anonymization\r\n        Dependability\r\n        Situational awareness\r\n        Threat intelligence\r\n        Blockchain, ledger technologies and their applications\r\n\r\n    Wireless Networking\r\n        5G access networks\r\n        Long-range communication\r\n        Ad-hoc and mesh networks\r\n        Mobile networks, self-organizing networks\r\n        Wireless sensor networks\r\n        Visible light communication\r\n        Localization\r\n        Delay/disruption tolerant networks\r\n        Opportunistic networks\r\n        Wireless power transfer networks\r\n        Device-to-device communication\r\n        Vehicular networks"]], "MSN": [["c", "MSN", "International Conference on Mobile Ad-hoc and Sensor Networks", "2019-08-31", "2019-10-15", "2019-12-11", "1769"], ["MSN 2019: International Conference on Mobile Ad-hoc and Sensor Networks", "https://conference.cs.cityu.edu.hk/msn2019/", {"Submission Date": "2019-08-31 Extended", "Notification Date": "2019-10-15", "Conference Date": "2019-12-11", "Location": "Hong Kong, China", "Years": "15"}, "The 15th International Conference on Mobile Ad-hoc and Sensor Networks (MSN 2019)\r\n\r\nThe Hong Kong Polytechnic University, Hong Kong\r\nDecember 11-13, 2019\r\n\r\nScope and Objectives\r\n\r\nMobile ad-hoc and sensor networking is a key area of enabling technologies for the next-generation Internet of Things and Cyber-Physical Systems. Recent years have witnessed the increasing convergence of algorithms, protocols, and applications for mobile ad-hoc and sensor networks in a range of applications including connected vehicles, smart cities, and smart health. Building on the past 14 years of success, the 15th International Conference on Mobile Ad-hoc and Sensor Networks (MSN 2019) provides a forum for academic researchers and industry practitioners to exchange new research ideas, present their progress, and identify future directions in the field of mobile ad-hoc and sensor networks.\r\n\r\nThe conference solicits submissions from all areas relating to mobile sensing and networking as well as corresponding applications. Contributions must relate to at least one of the following topics of interest:\r\n\r\n    Networking technologies and protocols for mobile ad hoc and sensor networks, such as 5G networks, cognitive radio, and low-power networking\r\n    Applications of artificial intelligence in networking and communications\r\n    Delay-tolerant and opportunistic networking\r\n    System designs for mobile ad hoc and sensor networks\r\n    Distributed computing technologies for mobile networks, such as edge and fog computing and smart networks\r\n    Network security and privacy\r\n    Novel applications and architectures of mobile ad-hoc and sensor networks in urban computing, smart city systems, or the Internet of Things\r\n    Mobile social networks, crowdsensing and mobile computing\r\n    Intelligent sensor and vehicular networks\r\n    Practical experiences with mobile ad hoc and sensor networks\r\n\r\nMSN 2019 is supported by the Hong Kong Polytechnic University, the City University of Hong Kong, and technically co-sponsored by IEEE (pending approval). It is on the CCF conference list."]], "MSWiM": [["c", "MSWiM", "International Conference on Modeling, Analysis and Simulation of Wireless and Mobile Systems", "2019-05-15", "2019-06-30", "2019-11-25", "310"], ["MSWiM 2019: International Conference on Modeling, Analysis and Simulation of Wireless and Mobile Systems", "http://mswimconf.com/2019/", {"Submission Date": "2019-05-15", "Notification Date": "2019-06-30", "Conference Date": "2019-11-25", "Location": "Miami, Florida, USA", "Years": "22"}, "ACM MSWiM 2019 is the 22nd Annual International Conference on Modeling, Analysis and Simulation of Wireless and Mobile Systems. MSWiM is an international forum dedicated to in-depth discussion of Wireless and Mobile systems, networks, algorithms and applications, with an emphasis on rigorous performance evaluation. MSWiM is a highly selective conference with a long track record of publishing innovative ideas and breakthroughs. MSWiM 2019 will be held in Miami, USA.\r\n\r\nAuthors are encouraged to submit full papers presenting new research related to the theory or practice of all aspects of modeling, analysis and simulation of mobile and wireless systems. Submitted papers must not have been published elsewhere nor currently be under review by another conference or journal.\r\n\r\nTopics of Interest\r\n\r\nPapers related to wireless and mobile network Modeling, Analysis, Design, and Simulation are solicited on, but not limited to, the following topics in mobile and wireless systems:\r\n\r\n    Performance evaluation and modeling\r\n    Analytical Models\r\n    Simulation languages and tools for wireless systems\r\n    Wireless measurements tools and experiences\r\n    Formal methods for analysis of wireless systems\r\n    Correctness, survivability and reliability evaluation\r\n    Mobility modeling and management\r\n    Models and protocols for cognitive radio networks\r\n    Models and protocols for autonomic, or self-* networks\r\n    Capacity, coverage and connectivity modeling and analysis\r\n    Wireless network algorithms and protocols\r\n    Software Defined Network\r\n    Services for Smart City\r\n    Wireless PANs, LANs\r\n    Ad hoc and MESH networks\r\n    Vehicular Ad-hoc Networks (VANET)\r\n    Sensor and actuator networks\r\n    Delay Tolerant Networks\r\n    Integration of wired and wireless systems\r\n    Pervasive computing and emerging models\r\n    Wireless multimedia systems\r\n    QoS provisioning in wireless and mobile networks\r\n    Security and privacy of mobile/wireless systems\r\n    Algorithms and protocols for energy efficient operation and power control\r\n    Mobile applications, system software and algorithms\r\n    RF channel modeling and analysis\r\n    Design methodologies\r\n    Tools, prototypes and testbeds\r\n    Parallel and distributed simulation of wireless systems\r\n    Wireless Communication and Mobile Networking\r\n    Operating systems for mobile computations\r\n    Programming language support for mobility\r\n    Resource management techniques\r\n    Management of mobile object systems\r\n\r\nPaper Submission and Publication\r\n\r\nHigh-quality original papers are solicited. Papers must be unpublished and must not be submitted for publication elsewhere. All papers will be reviewed by Technical Program Committee members and other experts active in the field to ensure high quality and relevance to the conference. Short papers will be included in the technical program to complement mature results and foster discussion and exchange of novel ideas at an early stage. More detailed instructions for paper submission will be provided soon. Accepted papers will appear in the conference proceedings to be published by ACM Press."]], "WASA": [["c", "WASA", "International Conference on Wireless Algorithms, Systems, and Applications", "2020-03-05", "2020-04-05", "2020-06-24", "1695"], ["WASA 2020: International Conference on Wireless Algorithms, Systems, and Applications", "http://wasa-conference.org/WASA2020", {"Submission Date": "2020-03-05", "Notification Date": "2020-04-05", "Conference Date": "2020-06-24", "Location": "Qingdao, China", "Years": "15"}, "WASA is designed to be a forum for theoreticians, system and application designers, protocol developers and practitioners to discuss and express their views on the current trends, challenges, and state-of-the-art solutions related to various issues in wireless networks. Topics of interests include, but are not limited to, effective and efficient state-of-the-art algorithm design and analysis, reliable and secure system development and implementations, experimental study and testbed validation, and new application exploration in wireless networks.\r\n\r\nTopics of interest include, but are not limited to:\r\n\r\nCognitive Radio Networks, Software-defined radio, reconfigurable radio networks\r\nCyber-physical systems including intelligent transportation systems and smart healthcare systems\r\nTheoretical frameworks and analysis of fundamental cross-layer protocol and network design and performance issues\r\nDistributed and localized algorithm design and analysis\r\nInformation and Coding theory for Wireless Networks\r\nLocalization\r\nMobility models and mobile social networking\r\nMobile cloud computing\r\nTopology control and coverage\r\nSecurity and privacy\r\nUnderwater and underground Networks\r\nVehicular networks\r\nRadar and Sonar Networks\r\nPHY/MAC/Routing protocols\r\nInformation processing and data management\r\nProgrammable service interfaces\r\nEnergy-efficient algorithms, systems and protocol design\r\nOperating system and middleware support\r\nPervasive and ubiquitous computing\r\nLocal area and personal wireless networks\r\nApplications, design, and performance of wireless ad hoc and sensor networks\r\nDelay/disruption tolerant networks\r\nExperimental testbeds, models and case studies"]], "HotNets": [["c", "HotNets", "ACM Workshop on Hot Topics in Networks", "2019-06-24", "2019-09-17", "2019-11-13", "314"], ["HotNets 2019: ACM Workshop on Hot Topics in Networks", "http://conferences.sigcomm.org/hotnets/2019/", {"Submission Date": "2019-06-24", "Notification Date": "2019-09-17", "Conference Date": "2019-11-13", "Location": "Princeton, New Jersey, USA", "Years": "18"}, "The 18th ACM Workshop on Hot Topics in Networks (HotNets 2019) will bring together researchers in computer networks and systems to engage in a lively debate on the theory and practice of computer networking. HotNets provides a venue for discussing innovative ideas and for debating future research agendas in networking.\r\n\r\nWe invite researchers and practitioners to submit short position papers. We encourage papers that identify fundamental open questions, advocate a new approach, offer a constructive critique of the state of networking research, re-frame or debunk existing work, report unexpected early results from a deployment, report on promising but unproven ideas, or propose new evaluation methods. Novel ideas need not be supported by full evaluations; well-reasoned arguments or preliminary evaluations can support the possibility of the paper’s claims.\r\n\r\nWe seek early-stage work, where the authors can benefit from community feedback. An ideal submission has the potential to open a line of inquiry for the community that results in multiple conference papers in related venues (SIGCOMM, SOSP, OSDI, NSDI, MobiCom, MobiSys, CoNEXT, etc.), rather than a single follow-on conference paper. The program committee will explicitly favor early work and papers likely to stimulate reflection and discussion over “conference papers in miniature”. Finished work that fits in a short paper is likely a better fit with the short-paper tracks at either CoNEXT or IMC, for example.\r\n\r\nHotNets takes a broad view of networking research. This includes new ideas relating to (but not limited to) mobile, wide-area, data-center, home, and enterprise networks using a variety of link technologies (wired, wireless, visual, and acoustic), as well as social networks and network architecture. It encompasses all aspects of networks, including (but not limited to) packet-processing hardware and software, virtualization, mobility, provisioning and resource management, performance, energy consumption, topology, robustness and security, measurement, diagnosis, verification, privacy, economics and evolution, interactions with applications, and usability of underlying networking technologies.\r\n\r\nPosition papers will be selected based on originality, likelihood of stimulating insightful discussion at the workshop, and technical merit. Accepted papers will be posted online prior to the workshop and will be published in the ACM Digital Library to facilitate wide dissemination of the ideas discussed at the workshop.\r\n\r\nPolicy on Concurrent Submissions\r\n\r\nConcurrent submissions to HotNets 2019 and any other peer-reviewed venue that cover the same work (differences in degree of detail given the two venues’ length limits notwithstanding) are prohibited, and will result in the rejection of the HotNets submission in question. “Concurrent” means any other peer-reviewed venue whose reviewing period (i.e., between submission and notification) overlaps with that of HotNets. The “same work” means, for example, a submission overlapping significantly in content with a conference submission. However, a position paper submitted to HotNets (e.g., that reflects broadly on the state of some aspect of the field, adopts a position as to how the field should move forward, or articulates a broad avenue of future work) will not be considered the “same work” as a conference-length paper on a specific system that addresses a point under the broad umbrella covered by the position paper. Authors with questions about the concurrent submission policy are encouraged to contact the PC chairs prior to submitting.\r\n\r\nEthical Concerns\r\n\r\nAs part of the submission process, authors must attest that their work complies with all applicable ethical standards of their home institution(s), including, but not limited to privacy policies and policies on experiments involving humans. Note that submitting research for approval by one’s institution’s ethics review body is necessary, but not sufficient – in cases where the PC has concerns about the ethics of the work in a submission, the PC will have its own discussion of the ethics of that work. The PC takes a broad view of what constitutes an ethical concern, and authors agree to be available at any time during the review process to rapidly respond to queries from the PC chairs regarding ethical standards.\r\n\r\nWorkshop Participation\r\n\r\nHotNets attendance is limited to roughly 90 people, to facilitate lively discussion. Invitations will be allocated first to one author of each paper, HotNets organizers and committee members, and conference sponsors. To promote an inclusive workshop, HotNets will also make a limited number of open registration slots available to the community. "]]}