{"JSAC": [["a", "JSAC", "IEEE Journal on Selected Areas in Communications", "7.172", "IEEE", "0733-8716", "6"], ["IEEE Journal on Selected Areas in Communications (JSAC)", "http://dl.comsoc.org/sac/", {"Impact Factor": "7.172", "Publisher": "IEEE", "ISSN": "0733-8716", "Viewed": "12113", "Tracked": "40"}, "Each issue of the IEEE Journal on Selected Areas in Communications (J-SAC) is devoted to a specific technical topic and thus provides to J-SAC readers a collection of up-to-date papers on that topic. These issues are valuable to the research community and become valuable references. The technical topics covered by J-SAC issues span the entire field of communications and networking. J-SAC publishes only papers that are submitted in response to a Call-for-Papers. These calls are published in J-SAC issues and other publications of the IEEE Communications Society as appropriate to the subject area of the call. Papers submitted for review for possible publication in a J-SAC issue must be submitted to one of the Guest Editors listed in the Call-for-Papers. \r\n\r\nRecent issue themes included:\r\n\r\n    Speech and Image Coding.\r\n    Medical Communications.\r\n    HDTV and Digital Video Communications.\r\n    B-ISDN Applications and Economics.\r\n    Wireless Personal Communications.\r\n    Advances in Satellite Communication.\r\n    Fading Channels and Equalization.\r\n    Spread Spectrum."]], "TOIT": [["b", "TOIT", "ACM Transactions on Internet Technology", "1.489", "ACM", "1533-5399", "22"], ["ACM Transactions on Internet Technology (TOIT)", "http://toit.acm.org/", {"Impact Factor": "1.489", "Publisher": "ACM", "ISSN": "1533-5399", "Viewed": "9883", "Tracked": "16"}, "ACM Transactions on Internet Technology (TOIT) is the premier multi-disciplinary scholarly journal on Internet/Web foundational and application technology and on social issues and public policy. Internet/Web technology encompasses many disciplines in computing, including computer software engineering, computer programming languages, middleware, management of unstructured, semi-structured and structured data, security, electronic commerce, knowledge discovery and data mining, multimedia data management, networking and distributed systems, communications, performance and scalability, etc. The social issues and public policy include all major ways in which use of Internet/Web technology impacts the society and people.\r\n\r\nTOIT has historically focused on the technology and societal issues associated with the services on which the Internet is built, e.g., session layer and above. A good source for journal scope are the journal papers themselves. Prospective authors are encouraged to review past issues for a perspective on topic relevance. For further reference, we provide a non-inclusive list of topics that are generally appropriate for the journal:\r\n\r\n    Digital mass media\r\n    Digital rights management\r\n    E-government\r\n    Electronic commerce\r\n    Internet application programming environments\r\n    Internet crime and law\r\n    Internet performance and scalability\r\n    Internet protocols\r\n    Internet research platforms, e.g., PlanetLab, GENIE\r\n    Library and education\r\n    Online auctions and trading agents\r\n    Online entertainment (music, movies, games, art, museums, etc.)\r\n    Peer-to-peer networks\r\n    Personalization\r\n    Search\r\n    Security and privacy\r\n    Spam\r\n    Taxation and international trade\r\n    Tele-medicine\r\n    Web measurements\r\n    XML/HTML document management\r\n\r\nNote: TOIT will accept survey papers very rarely, i.e. one or fewer a year---authors should most likely contact the editor-in-chief before considering submission."]], "TOMCCAP": [["b", "TOMCCAP", "ACM Transactions on Multimedia Computing, Communications and Applications", "0.982", "ACM", "1551-6857", "23"], ["ACM Transactions on Multimedia Computing, Communications and Applications (TOMCCAP)", "http://tomccap.acm.org/", {"Impact Factor": "0.982", "Publisher": "ACM", "ISSN": "1551-6857", "Viewed": "9943", "Tracked": "20"}, "The ACM Transactions on Multimedia Computing, Communications and Applications (TOMCCAP) is an ACM multidisciplinary, archival, scholarly journal in the general field of multimedia and applications, which started operating in January 2004. It is the prime ACM journal in the field. Multimedia is now a mature area, having evolved over approximately 20 years. The term “media” traditionally referred to entities such as audio, video, text, images, graphics, animation. New media will be added in the future, including virtual reality, holography, haptics, eSmell, eTaste, eThought, …. The term “multimedia” has now been accepted to mean documents composed of at least two correlated media. The correlation could be temporal, spatial or semantic. Applications now appear in many fields such as entertainment, publishing, advertising, banking, insurance, e-commerce, travel, medical, defense, training, geographical information systems, weather and many others.\r\n \r\nTOMCCAP is soliciting paper submissions on all aspects of multimedia, as defined above, including systems, devices, signal processing and coding, graphics, databases, retrieval, networking and applications. Papers on single media (audio, video, animation, haptics,..), their processing, networking  and applications are also welcome. However, papers covering a single algorithm or aspect of one specific kind of media only (like e.g. image compression algorithms) are likely to be rejected.\r\n\r\nOf special interest are papers on the following three major challenges: (i) new authoring tools that make authoring complex multimedia as easy as using a word processor or a drawing program, (ii) applications that make interactions with remote people and environments nearly the same as interactions with local people and environments and (iii) multimedia systems that make capturing, storing, finding, and using digital media an everyday occurrence in our computing environment. Papers on new integrated media, including virtual reality, haptics, holography, eSmell, eTaste, eThought are also highly encouraged.\r\n\r\nThe transactions consists primarily of research papers. This is an archival journal and it is intended that the papers will have lasting importance and value over time. In general, papers whose primary focus is on particular multimedia products will not be included.\r\n\r\nThe journal accepts publications in the three general subfields of multimedia computing, communications, and applications, each consisting of various areas of research. Note that this is not an exclusive list: other topics in these fields (computing, communications, applications) are also accepted.\r\n\r\n    multimedia computing (research on systems support)\r\n        I/O devices\r\n        OS requirements\r\n        storage systems\r\n        multimedia data abstractions\r\n        continuous media representations\r\n        media coding and processing\r\n        multimodal human-centered computing\r\n        media content security and rights management\r\n    multimedia communications (research on computer networks support)\r\n        real-time protocols\r\n        network resource allocation\r\n        multicast and group communication protocols\r\n        broadband multimedia\r\n        wireless multimedia\r\n        multimedia streaming\r\n    multimedia applications (research on tools and applications)\r\n        databases\r\n        distributed collaboration\r\n        video conferencing\r\n        3D virtual environments and tele-presence\r\n        content authoring\r\n        content search\r\n        webcasting\r\n        multimedia-based teaching & learning\r\n        multi-player games\r\n        Internet television\r\n        multimodal affective computing"]], "TOSN": [["b", "TOSN", "ACM Transactions on Sensor Networks", " ", "ACM", "1550-4859", "24"], ["ACM Transactions on Sensor Networks (TOSN)", "http://tosn.acm.org/", {"Publisher": "ACM", "ISSN": "1550-4859", "Viewed": "7971", "Tracked": "16"}, ""]], "CN": [["b", "CN", "Computer Networks", "3.030", "ELSEVIER", "1389-1286", "26"], ["Computer Networks (CN)", "http://www.journals.elsevier.com/computer-networks/", {"Impact Factor": "3.030", "Publisher": "ELSEVIER", "ISSN": "1389-1286", "Viewed": "11582", "Tracked": "44"}, "Computer Networks is an international, archival journal providing a publication vehicle for complete coverage of all topics of interest to those involved in the computer communications networking area. The audience includes researchers, managers and operators of networks as well as designers and implementors. The Editorial Board will consider any material for publication that is of interest to those groups.\r\n\r\nSUBJECT COVERAGE\r\n\r\nThe topics covered by the journal but not limited to these are:\r\n\r\n1. Communication Network Architectures:\r\nNew design contributions on Local Area Networks (LANs), Metropolitan Area Networks (MANs), Wide Area Networks (WANs) including Wired, Wireless, Mobile, Cellular, Sensor, Optical, IP, ATM, and other related network technologies, as well as new switching technologies and the integration of various networking paradigms.\r\n\r\n2. Communication Network Protocols:\r\nNew design contributions on all protocol layers except the Physical Layer, considering all types of networks mentioned above and their performance evaluation; novel protocols, methods and algorithms related to, e.g., medium access control, error control, routing, resource discovery, multicasting, congestion and flow control, scheduling, multimedia quality of service, as well as protocol specification, testing and verification.\r\n\r\n3. Network Services and Applications:\r\nWeb, Web caching, Web performance, Middleware and operating system support for all types of networking, electronic commerce, quality of service, new adaptive applications, and multimedia services.\r\n\r\n4. Network Security and Privacy:\r\nSecurity protocols, authentication, denial of service, anonymity, smartcards, intrusion detection, key management, viruses and other malicious codes, information flow, data integrity, mobile code and agent security.\r\n\r\n5. Network Operation and Management:\r\nIncluding network pricing, network system software, quality of service, signaling protocols, mobility management, power management and power control algorithms, network planning, network dimensioning, network reliability, network performance measurements, network modeling and analysis, and overall system management.\r\n\r\n6. Discrete Algorithms and Discrete Modeling\r\nAlgorithmic and discrete aspects in the context of computer networking as well as mobile and wireless computing and communications. Fostering cooperation among practitioners and theoreticians in this field.\r\n\r\nTYPES OF CONTRIBUTIONS CONSIDERED\r\n\r\nThe primary purpose of the journal is to publish original and complete papers covering a specific topic or project in the above mentioned areas in sufficient detail and depth to be of practical use to interested readers. The readers should benefit from the novel solutions and analyses presented in the papers. Enhanced, extended versions of quality papers presented at conferences or workshops can be submitted to our journal for review. Note that papers which were already published with the same contents or simultaneous submission of the same paper to other journals or conferences will not be considered for publication in our journal and will be immediately rejected."]], "TCOM": [["b", "TCOM", "IEEE Transaction on Communications", "1.365", "IEEE", "0090-6778", "27"], ["IEEE Transaction on Communications (TCOM)", "http://dl.comsoc.org/comm/", {"Impact Factor": "1.365", "Publisher": "IEEE", "ISSN": "0090-6778", "Viewed": "10063", "Tracked": "19"}, "The field of interest of the Communications Society consists of all telecommunications including telephone, telegraphy, facsimile, and point-to-point television, by electromagnetic propagation including radio; wire; aerial; underground, coaxial, and submarine cables; waveguides, communication satellites, and lasers; in marine, aeronautical, space and fixed station services; repeaters, radio relaying, signal storage, and regeneration; telecommunication error detection and correction; multiplexing and carrier techniques; communication switching systems; data communications; and communication theory.\r\n\r\nEditorial Groups:\r\n\r\n    Modulation & Signal Design\r\n    Wireless Communication\r\n    Optical Communication\r\n    Source-Channel Coding & Signal Processing\r\n    Transmission Systems\r\n    Networking & Cross-Layer Design\r\n    Coding & Communication Theory"]], "TWC": [["b", "TWC", "IEEE Transaction on Wireless Communications", "2.152", "IEEE", "1536-1276", "28"], ["IEEE Transaction on Wireless Communications (TWC)", "http://dl.comsoc.org/twc/", {"Impact Factor": "2.152", "Publisher": "IEEE", "ISSN": "1536-1276", "Viewed": "9616", "Tracked": "25"}, " We invite the submission of high-quality manuscripts on advances in the state-of-the-art of wireless communications. Both theoretical contributions (including new techniques, concepts, and analyses) and practical contributions (including system experiments and prototypes, and new applications) are encouraged.\r\n\r\nThe general scope of the journal includes, but is not limited to:\r\n\r\n    Broadband wireless communications\r\n    Modulation and coding\r\n    Detection and estimation\r\n    Diversity techniques and equalization\r\n    Propagation and channel characterization\r\n    Fading countermeasures\r\n    Multiuser detection\r\n    Signal separation and interference rejection\r\n    Multimedia communications over wireless\r\n    DSP applications to wireless systems\r\n    Network architectures and protocols\r\n    Adaptive antennas for wireless systems\r\n    Multiple access techniques   \r\n    Space-time processing\r\n    Synchronization techniques\r\n    Location estimation\r\n    Software radio\r\n    Tracking\r\n    Resource allocation and interference management\r\n    Multirate and multicarrier communications\r\n    Security, privacy, and authentication\r\n    Experimental and prototype results\r\n    Systems and services (e.g., Mobile satellites, WLANs)\r\n    Wireless sensor networks\r\n    Cross-layer design and optimization\r\n    Ad hoc wireless networks \r\n\r\nIn addition, papers on specific topics or on more non-traditional topics related to specific application areas, are encouraged.  Examples include OFDM, MIMO systems, Cooperative networks, Cognitive radio, and Ultra-wideband communications."]], "TNSM": [["c", "TNSM", "IEEE Transactions on Network and Service Management", " ", "IEEE", "1932-4537", "43"], ["IEEE Transactions on Network and Service Management (TNSM)", "http://dl.comsoc.org/tnsm/", {"Publisher": "IEEE", "ISSN": "1932-4537", "Viewed": "11942", "Tracked": "25"}, "IEEE Transactions on Network and Service Management (IEEE TNSM) is a journal for timely publication of archival research on the management of networks, systems, services and applications, as well as on issues in communications software, service engineering, policies and business processes for network and service management. First issue 2007. Subscribers receive online access and an annual archive CD. Print edition is not available.\r\n\r\nThe topics covered include:\r\n\r\n    Management Models, Architectures and Frameworks , including agents and proxies, interoperability and cooperative control, distributed management, integrated management, proactive and reactive Management, self-management and autonomic networks.\r\n    Service Provisioning, Reliability and Quality Assurance , including network planning and service deployment, service-level agreements, quality-of-service management, service pricing, network survivability and resilience, operations support systems and customer care.\r\n    Management Functions, including network and systems monitoring and measurements, configuration management, security, management of faults and performance management, accounting management and billing.\r\n    Enabling Technologies for Management, including distributed platforms,mobile, intelligent and programmable agents, data warehousing, mining and statistical methods, user interfaces and virtual reality.\r\n    Information and Communication Models , including management information and data models, ontologies for management data, management protocols, standards such as SNMP, CIM, Web Services, etc.\r\n    Management Policies , including business processes for network and service management, policy-based management, features interaction and conflict resolution, role-based management.\r\n    Management applications and case studies , including management aspects in VPNs, Voice over IP and multimedia services, optical, CATV, power line networks, wireless, mobile, ad-Hoc and sensor networks, e-transaction-oriented services and electronic commerce, peer-to-peer network technologies and grids."]], "JNCA": [["", "JNCA", "International Journal of New Computer Architectures and their Applications", " ", "SDIWC", "2220-9085", "302"], ["International Journal of New Computer Architectures and their Applications (IJNCAA)", "http://www.sdiwc.net/ijncaa/", {"Publisher": "SDIWC", "ISSN": "2220-9085", "Viewed": "5522", "Tracked": "0"}, "The SDIWC International Journal of New Computer Architectures and Their Applications (IJNCAA) is a refereed online journal designed to address the following topics: new computer architectures, digital resources, and mobile devices, including cell phones. In our opinion, cell phones in their current state are really computers, and the gap between these devices and the capabilities of the computers will soon disappear. Original unpublished manuscripts are solicited in the areas such as computer architectures, parallel and distributed systems, microprocessors and microsystems, storage management, communications management, reliability, and VLSI.\r\n\r\nAs one of the most important aims of this journal is to increase the usage and impact of knowledge as well as increasing the visibility and ease of  use of scientific materials, IJNCAA does NOT CHARGE authors for any publication fee for online publishing of their materials in the journal and does NOT CHARGE readers or their institutions for accessing to the published materials.\r\n\r\nThe SDIWC International Journal of New Computer Architectures and Their Applications aims to provide a forum for scientists, engineers, and practitioners to present their latest research results, ideas, developments and applications in the field of computer architectures, information technology, and mobile technologies.\r\n\r\nOriginal unpublished manuscripts are solicited in the following areas including but not limited to:\r\n\r\n    Computer Architectures\r\n    Parallel and Distributed Systems\r\n    Storage Management\r\n    Microprocessors and Microsystems\r\n    Communications Management\r\n    Reliability\r\n    VLSI"]], "MONET": [["c", "MONET", "Mobile Networks & Applications", "0.683", "Springer", "1383-469X", "46"], ["Mobile Networks & Applications (MONET)", "http://www.springer.com/engineering/signals/journal/11036", {"Impact Factor": "0.683", "Publisher": "Springer", "ISSN": "1383-469X", "Viewed": "7916", "Tracked": "11"}, "Mobile Networks and Applications' technical scope covers mobility solutions that provide communication technologies and mobile services, which enables users to access resources and share information freely, anytime anywhere. The emerging symbiosis of wireless communication, the ever more powerful mobile devices, with the back-end resources of the cloud, making the user fully location independent.\r\n\r\nThe journal addresses the convergence of mobility, computing and information organization, services and management. In approving Special Issues, the Journal places an equal emphasis on the various areas of nomadic computing, data management, related software and hardware technologies, and mobile user services, alongside more `classical' topics in wireless and mobile networking. The journal documents practical and theoretical results which make a fundamental contribution."]], "PPNA": [["c", "PPNA", "Peer-to-Peer Networking and Applications", "1.000", "Springer", "1936-6442", "48"], ["Peer-to-Peer Networking and Applications (PPNA)", "http://www.springer.com/engineering/signals/journal/12083", {"Impact Factor": "1.000", "Publisher": "Springer", "ISSN": "1936-6442", "Viewed": "8629", "Tracked": "17"}, "Peer-to-Peer Networking and Applications (P2PNA) has received significant attention from both academia and industry in recent years. The aim of the Peer-to-Peer Networking and Applications journal is to disseminate state-of-the-art research and development results in this rapidly growing research area, to facilitate the deployment of P2P networking and applications, and to bring together the academic and industry communities, with the goal of fostering interaction to promote further research interests and activities, thus enabling new P2P applications and services. The journal not only addresses research topics related to networking and communications theory, but also considers the standardization, economic, and engineering aspects of P2P technologies, and their impacts on software engineering, computer engineering, networked communication, and security.\r\n\r\nPeer-to-Peer Networking and Applications is committed to the timely publication of high-quality, original papers that advance the cutting-edge research in the area of peer-to-peer networking, services, and applications. The journal serves as a forum for tackling the technical problems arising from both file sharing and media streaming applications. It also includes state-of-the-art technologies in the P2P security domain.\r\n\r\nPeer-to-Peer Networking and Applications publishes regular papers, tutorials and review papers, case studies, and correspondence from the research, development, and standardization communities. Papers addressing system, application, and service issues are encouraged. The Journal covers all subject areas of peer-to-peer networking and applications including, but not limited to:\r\n\r\n    P2P ad hoc and sensor networks\r\n    P2P application and services\r\n    P2P content access and distribution\r\n    P2P economics\r\n    P2P enabled technologies\r\n    P2P file sharing\r\n    P2P media streaming\r\n    P2P multicasting and multimedia delivery\r\n    P2P overlay networks"]], "WCMC": [["c", "WCMC", "Wireless Communications and Mobile Computing", "1.899", "Hindawi", "1530-8669", "49"], ["Wireless Communications and Mobile Computing (WCMC)", "https://www.hindawi.com/journals/wcmc/", {"Impact Factor": "1.899", "Publisher": "Hindawi", "ISSN": "1530-8669", "Viewed": "13455", "Tracked": "33"}, "Presenting comprehensive coverage of this fast moving field, Wireless Communications and Mobile Computing provides the R&D communities working in academia and the telecommunications and networking industries with a forum for sharing research and ideas.\r\n\r\nThe convergence of wireless communications and mobile computing is bringing together two areas of immense growth and innovation. This is reflected throughout the journal by strongly focusing on new trends, developments, emerging technologies and new industrial standards.\r\n\r\nUnder the guidance of an international editorial and advisory board drawn from academia and industry, this high quality, peer-reviewed journal, provides leading edge coverage of the opportunities and challenges driving the research and development of mobile communication systems.\r\n\r\nAll you need to stay ahead ...\r\n\r\n    High calibre survey papers\r\n    Written by leading experts in the wireless and networking communities.\r\n    Rapid publication times\r\n    Due to electronic review and submission of original research papers\r\n    Special Issues\r\n    Addressing key topics of interest and managed by high profile editors\r\n    An international forum for the sharing of research and ideas\r\n    Key topics presented by leading individuals at the cutting edge of new technologies. "]], "Ad Hoc Networks": [["c", "Ad Hoc Networks", "Ad Hoc Networks", "3.490", "ELSEVIER", "1570-8705", "41"], ["Ad Hoc Networks", "http://www.journals.elsevier.com/ad-hoc-networks/", {"Impact Factor": "3.490", "Publisher": "ELSEVIER", "ISSN": "1570-8705", "Viewed": "10341", "Tracked": "24"}, "The Ad Hoc Networks is an international and archival journal providing a publication vehicle for complete coverage of all topics of interest to those involved in ad hoc and sensor networking areas. The Ad Hoc Networks considers original, high quality and unpublished contributions addressing all aspects of ad hoc and sensor networks. Specific areas of interest include, but are not limited to:\r\n\r\n    Mobile and Wireless Ad Hoc Networks\r\n    Sensor Networks\r\n    Wireless Local and Personal Area Networks\r\n    Home Networks\r\n    Ad Hoc Networks of Autonomous Intelligent Systems\r\n    Novel Architectures for Ad Hoc and Sensor Networks\r\n    Self-organizing Network Architectures and Protocols\r\n    Transport Layer Protocols\r\n    Routing protocols (unicast, multicast, geocast, etc.)\r\n    Media Access Control Techniques\r\n    Error Control Schemes\r\n    Power-Aware, Low-Power and Energy-Efficient Designs\r\n    Synchronization and Scheduling Issues\r\n    Mobility Management\r\n    Mobility-Tolerant Communication Protocols\r\n    Location Tracking and Location-based Services\r\n    Resource and Information Management\r\n    Security and Fault-Tolerance Issues\r\n    Hardware and Software Platforms, Systems, and Testbeds\r\n    Experimental and Prototype Results\r\n    Quality-of-Service Issues\r\n    Cross-Layer Interactions\r\n    Scalability Issues\r\n    Performance Analysis and Simulation of Protocols"]], "IET Communications": [["c", "IET Communications", "IET Communications", "0.624", "IET", "1751-8628", "44"], ["IET Communications", "http://www.ietdl.org/IET-COM", {"Impact Factor": "0.624", "Publisher": "IET", "ISSN": "1751-8628", "Viewed": "14888", "Tracked": "22"}, "IET Communications covers the fundamental and generic research for a better understanding of communication technologies to harness the signals for better performing communication systems using various wired and/or wireless media. This Journal is particularly interested in research papers reporting novel solutions to the dominating problems of noise, interference, timing and errors for reduction systems deficiencies such as wasting scarce resources such as spectra, energy and bandwidth.\r\n\r\nTopics include, but are not limited to:\r\n\r\n    Coding and Communication Theory;\r\n    Modulation and Signal Design;\r\n    Wired, Wireless and Optical Communication;\r\n    Communication System"]], "Wireless Networks": [["c", "Wireless Networks", "Wireless Networks", "0.958", "Springer", "1022-0038", "50"], ["Wireless Networks", "http://www.springer.com/engineering/signals/journal/11276", {"Impact Factor": "0.958", "Publisher": "Springer", "ISSN": "1022-0038", "Viewed": "7653", "Tracked": "13"}, "The wireless communication revolution has brought fundamental changes to data networking, telecommunication, and has made integrated networks a reality. Wireless Networks focuses on the networking and user aspects of this field. It provides a single common and global forum for archival value contributions documenting these fast growing areas of interest. The journal publishes refereed articles dealing with research, experience and management issues of wireless networks. It allows readers to benefit from experience, problems and solutions described. Regularly addressed issues include: network architectures for personal communication systems, wireless LANS, radio, tactical and other wireless networks, design and analysis of protocols, network management and network performance, network services and service integration, nomadic computing, internets working with cable and other wireless networks, standardization and regulatory issues, specific system descriptions, applications and user interface, and enabling technologies for wireless networks."]], "IEEE/ACM Transactions on Networking": [["a", "IEEE/ACM Transactions on Networking", "IEEE/ACM Transactions on Networking", " ", "IEEE/ACM", "1063-6692", "5"], ["IEEE/ACM Transactions on Networking (TON)", "http://www.comsoc.org/ton", {"Publisher": "IEEE/ACM", "ISSN": "1063-6692", "Viewed": "9771", "Tracked": "43"}, "The IEEE/ACM Transactions on Networking is committed to the timely publication of high-quality papers that advance the state of the art in communication network research. The journal publishes theoretical research presenting new techniques, concepts, or analyses and applied contributions reporting on experiences and experiments with actual systems.\r\n\r\nThe topics covered by this journal include:\r\n\r\n    High level objective: to publish high-quality, original research results derived from theoretical or experimental exploration of the area of communication/computer networking, covering all sorts of information transport networks over all sorts of physical layer technologies, both wireline (all kinds of guided media: e.g., copper, optical) and wireless (e.g., radio-frequency, acoustic, underwater, infra-red), or hybrids of these. The journal welcomes applied contributions reporting on novel experiences and experiments with actual systems.\r\n\r\n    Network types: IP-scale to global telecom to inter-planetary, networks-on-chip, high-speed intra-system interconnection networks, backbone and access telecom networks, logical and overlay networks, cellular mobile telecom networks, wireless local area networks, ad hoc and mesh wireless networks, inter-vehicular networks, delay/disruption-tolerant networks, etc.\r\n\r\n    Networking aspects: architecture and design (including algorithms for network resource allocation, traffic engineering, modeling, and performance analysis), protocols (including formal methods for the verification, testing, and conversion of communication protocols), network software (including software architecture and applications such as directory services, call processing, and signaling), network hardware (including novel hardware architectures, network devices, and their usage), operations and management (including network planning, evolution, reliability, and survivability), measurements (including insights gained from operational networks and network tomography), and security (including network intrusion detection and control of the spread of malicious software).\r\n\r\n    Application domains: telephony (circuit and packet, voice and video), all applications traditionally associated with world-wide packet networks (file transfer, email, World Wide Web, streaming video, etc.), storage and data centers, peer-to-peer file sharing, online social networks, cyber-physical systems (including distributed sensing, function computation over networks, and control over networks), etc.\r\n\r\n    Interfaces with networks in other domains: including information dissemination and related distributed systems aspects of social networks and biologically or nature-inspired techniques for communication networks, etc."]], "IEEE Transactions on Mobile Computing": [["a", "IEEE Transactions on Mobile Computing", "IEEE Transactions on Mobile Computing", " ", "IEEE", "1536-1233", "7"], ["IEEE Transactions on Mobile Computing (TMC)", "http://www.computer.org/portal/web/tmc", {"Publisher": "IEEE", "ISSN": "1536-1233", "Viewed": "10484", "Tracked": "32"}, "The IEEE Transactions on Mobile Computing is a monthly publication with a wide distribution to researchers, developers, technical managers, and educators in the computer field. It publishes papers, brief contributions, and comments on research in areas of current interest to the readers. These areas include, but are not limited to\r\n\r\n    architectures\r\n    support services\r\n    algorithm/protocol design and analysis\r\n    mobile environments\r\n    mobile communication systems\r\n    applications\r\n    components, including devices, hardware, and software\r\n    emerging technologies"]], "Computer Communications": [["c", "Computer Communications", "Computer Communications", "2.766", "ELSEVIER", "0140-3664", "42"], ["Computer Communications", "http://www.journals.elsevier.com/computer-communications/", {"Impact Factor": "2.766", "Publisher": "ELSEVIER", "ISSN": "0140-3664", "Viewed": "14462", "Tracked": "45"}, "Computer and Communications networks are key infrastructures of the information society with high socio-economic value as they contribute to the correct operations of many critical services (from healthcare to finance and transportation). Internet is the core of today's computer-communication infrastructures. This has transformed the Internet, from a robust network for data transfer between computers, to a global, content-rich, communication and information system where contents are increasingly generated by the users, and distributed according to human social relations. Next-generation network technologies, architectures and protocols are therefore required to overcome the limitations of the legacy Internet and add new capabilities and services. The future Internet should be ubiquitous, secure, resilient, and closer to human communication paradigms.\r\n\r\nComputer Communications is a peer-reviewed international journal that publishes high-quality scientific articles (both theory and practice) and survey papers covering all aspects of future computer communication networks (on all layers, except the physical layer), with a special attention to the evolution of the Internet architecture, protocols, services, and applications. Topics include, but are not limited to:\r\n\r\n    Emerging technologies for next generation network\r\n    LAN/WAN/MAN\r\n    Future Internet architecture, protocols and services\r\n    Content- and service-centric architecture\r\n    Mobile and ubiquitous networks\r\n    Self organizing/autonomic networking\r\n    Green networking\r\n    Internet content search\r\n    QoS and multimedia networking\r\n    Opportunistic networking\r\n    On-line social networks\r\n    Internet of things\r\n    Public safety communication networks\r\n    Network applications (web, multimedia streaming, VoIP, gaming, etc.)\r\n    Trust, security and privacy in computer and communication networks\r\n    Modeling, measurement and simulation\r\n    Complex network models\r\n    Internet socio-economic models\r\n    Experimental test-beds and research platforms\r\n    Algorithmic aspects of communication networks\r\n    Network scaling and limits"]]}